[1, {"impact": "3.557", "info": "\r\n\tIEEE Access® is a multidisciplinary, open access (OA), applications-oriented, all-electronic archival journal that continuously presents the results of original research or development across all of IEEE's fields of interest.\r\n\tIEEE Access will publish articles that are of high interest to readers, original, technically correct, and clearly presented. Supported by author publication charges (APC), its hallmarks are a rapid peer review and publication process with open access to all readers. Unlike IEEE's traditional Transactions or Journals, reviews are \"binary\", in that reviewers will either Accept or Reject an article in the form it is submitted in order to achieve rapid turnaround. Especially encouraged are submissions on:", "name": "Access, IEEE", "subjectList": ["Aerospace", "Bioengineering", "Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Engineered Materials, Dielectrics & Plasmas", "Engineering Profession", "Fields, Waves & Electromagnetics", "General Topics for Engineers", "Geoscience", "Nuclear Engineering", "Photonics & Electro-Optics", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis", "Transportation"], "influence": "1.098", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639", "eigen": "0.0186"}, {"impact": "1.36", "info": "IEEE Aerospace and Electronic Systems Magazine is a monthly magazine that publishes articles concerned with the various aspects of systems for space, air, ocean, or ground environments as well as news and information of interest to IEEE Aerospace and Electronic Systems Society members. The boundaries of acceptable subject matter has been intentionally left flexible so that the Magazine can follow the research activities, technology applications and future trends to better meet the needs of the members of the IEEE Aerospace and Electronic Systems Society. IEEE Aerospace and Electronic Systems Magazine articles apprise readers of new developments, new applications of cornerstone technology, and news of society members, meetings, and related items.", "name": "Aerospace and Electronics Systems Magazine, IEEE", "subjectList": ["Aerospace", "Transportation"], "influence": "0.345", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=62", "eigen": "0.00124"}, {"impact": "2.063", "info": "IEEE Transactions on Aerospace and Electronic Systems focuses on the organization, design, development, integration, and operation of complex systems for space, air, ocean, or ground environment.  These systems include, but are not limited to, navigation, avionics, spacecraft, aerospace power, radar, sonar, telemetry, defense, transportation, automated testing, and command and control. ", "name": "Aerospace and Electronic Systems, IEEE Transactions on", "subjectList": ["Aerospace", "Transportation"], "influence": "0.694", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7", "eigen": "0.0114"}, {"impact": "4.585", "info": "The IEEE Transactions on Affective Computing is a cross-disciplinary and international archive journal aimed at disseminating results of research on the design of systems that can recognize, interpret, and simulate human emotions and related affective phenomena. The journal publishes original research on the principles and theories explaining why and how affective factors condition interaction between humans and technology, on how affective sensing and simulation techniques can inform our understanding of human affective processes, and on the design, implementation and evaluation of systems that carefully consider affect among the factors that influence their usability. Surveys of existing work are considered for publication when they propose a new viewpoint on the history and the perspective on this domain. The journal covers but is not limited to the following topics::", "name": "Affective Computing, IEEE Transactions on", "subjectList": ["Computing & Processing", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": "1.272", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5165369", "eigen": "0.00308"}, {"impact": "0.619", "info": "The IEEE Annals of the History of Computing serves as a record of vital contributions which recount, preserve, and analyze the history of computing and the impact of computing on society. Where possible, first hand accounts of events and activities are recorded with minimal editorial change, and scholarly reports of analyses of the historical record from archives and personal contact are published so as to better understand both the past and the future of our field.", "name": "Annals of the History of Computing, IEEE", "subjectList": ["Computing & Processing", "General Topics for Engineers"], "influence": "0.185", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=85", "eigen": "0.00027"}, {"impact": "4.13", "info": "The IEEE Transactions on Antennas & Propagation publishes full papers and shorter Communications on original contributions within the general topics of electromagnetics, antennas and wave propagation. Specifically the journal focuses on: antennas, including analysis, design, development, measurement, and testing; radiation, propagation, and the interaction of electromagnetic waves with discrete and continuous media; and applications and systems pertinent to antennas, propagation, and sensing, such as applied optics, millimeter- and sub-millimeter-wave techniques, antenna signal processing and control, radio astronomy, and propagation and radiation aspects of terrestrial and space-based communication, including wireless, mobile, satellite, and telecommunications.", "name": "Antennas and Propagation, IEEE Transactions on", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "1.003", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8", "eigen": "0.05094"}, {"impact": "3.007", "info": "The IEEE Antennas and Propagation Magazine actively solicits feature articles that describe engineering activities taking place in industry, government, and universities. All feature articles are subject to peer review. Emphasis is placed on providing the reader with a general understanding of either a particular subject or of the technical challenges being addressed by various organizations, as well as their capabilities to cope with these challenges. Articles presenting new results, review, tutorial, and historical articles are welcome, as are articles describing examples of good engineering. The technical field of interest of the Magazine is the same as the IEEE Antennas and Propagation Society, and includes the following: antennas, including analysis, design, development, measurement, and testing; radiation, propagation, and the interaction of electromagnetic waves with discrete and continuous media; and applications and systems pertinent to antennas, propagation, and sensing, such as applied optics, millimeter- and sub-millimeter-wave techniques, antenna signal processing and control, radio astronomy, and propagation and radiation aspects of terrestrial and space-based communication, including wireless, mobile, satellite, and telecommunications.", "name": "Antennas and Propagation Magazine, IEEE", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "0.874", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=74", "eigen": "0.0055"}, {"impact": "3.448", "info": "IEEE Antennas and Wireless Propagation Letters (AWP Letters) is devoted to the rapid electronic publication of short manuscripts in the technical areas of Antennas and Wireless Propagation. These are areas of competence for the IEEE Antennas and Propagation Society (AP-S). AWPL aims to be one of the \"fastest\" journals among IEEE publications. This means that for papers that are eventually accepted, it is intended that an author may expect his or her paper to appear in IEEE Xplore, on average, around two months after submission.", "name": "Antennas and Wireless Propagation Letters, IEEE", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "0.978", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7727", "eigen": "0.03054"}, {"impact": "1.288", "info": "IEEE Transactions on Applied Superconductivity (TAS) contains articles on the applications of superconductivity and other relevant technology. Electronic applications include analog and digital circuits employing thin films and active devices such as Josephson junctions. Large scale applications include magnets for power applications such as motors and generators, for magnetic resonance, for accelerators, and cable applications such as power transmission. ", "name": "Applied Superconductivity, IEEE Transactions on", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics"], "influence": "0.248", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=77", "eigen": "0.01309"}, {"impact": "1.877", "info": "\r\n\tThe IEEE Transactions on Audio, Speech and Language Processing covers the sciences, technologies and applications relating to the analysis, coding, enhancement, recognition and synthesis of audio, music, speech and language. In particular, audio processing also covers auditory modeling, acoustic modeling and source separation. Speech processing also covers speech production and perception, adaptation, lexical modeling and speaker recognition. Language processing also covers spoken language understanding, translation, summarization, mining, general language modeling, as well as spoken dialog systems.", "name": "Audio, Speech and Language Processing, IEEE Transactions on", "subjectList": ["Signal Processing & Analysis"], "influence": "0.875", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10376", "eigen": "0.01105"}, {"impact": "5.007", "info": "In the IEEE Transactions on Automatic Control, the IEEE Control Systems Society publishes high-quality papers on the theory, design, and applications of control engineering.  Two types of contributions are regularly considered:\r\n1) Papers:  Presentation of significant research, development, or application of control concepts.\r\n2) Technical Notes and Correspondence:  Brief technical notes, comments on published areas or established control topics, corrections to papers and notes published in the Transactions.\r\nIn addition, special papers (tutorials, surveys, and perspectives on the theory and applications of control systems topics) are solicited.", "name": "Automatic Control, IEEE Transactions on", "subjectList": ["Signal Processing & Analysis"], "influence": "2.255", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9", "eigen": "0.05978"}, {"impact": "3.667", "info": "The IEEE Transactions on Automation Science and Engineering (T-ASE) publishes fundamental papers on Automation, emphasizing scientific results that advance efficiency, quality, productivity, and reliability. T-ASE encourages interdisciplinary approaches from computer science, control systems, electrical engineering, mathematics, mechanical engineering, operations research, and other fields. T-ASE welcomes results relevant to industries such as agriculture, biotechnology, healthcare, home automation, maintenance, manufacturing, pharmaceuticals, retail, security, service, supply chains, and transportation.  T-ASE addresses a research community willing to integrate knowledge across disciplines and industries. For this purpose, each paper includes a Note to Practitioners that summarizes how its results can be applied or how they might be extended to apply in practice.", "name": "Automation Science and Engineering, IEEE Transactions on", "subjectList": ["Robotics & Control Systems"], "influence": "1.137", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8856", "eigen": "0.00882"}, {"impact": "2.889", "info": "\r\n\tThe scope of IEEE Transactions on Autonomous Mental Development (TAMD) includes:", "name": "Autonomous Mental Development, IEEE Transactions on", "subjectList": ["Computing & Processing", "Signal Processing & Analysis"], "influence": "0.807", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4563672", "eigen": "0.00103"}, {"impact": "3.944", "info": "\r\n\tThe Bell Labs Technical Journal highlights results of research Bell Labs is undertaking aimed at solving the current challenges in information and communications technology (ICT), and finding solutions that are 10x better than those available today.  Articles and papers are written by Nokia Bell Labs  researchers, scientists, engineers, and technologists.", "name": "Bell Labs Technical Journal", "subjectList": ["Communication, Networking & Broadcasting"], "influence": "0.438\t\t\t", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6731002", "eigen": "0.001080"}, {"impact": "3.5", "info": "The IEEE Transactions on Biomedical Circuits and Systems addresses areas at the crossroads of Circuits and Systems and Life Sciences. The main emphasis is on microelectronic issues in a wide range of applications found in life sciences, physical sciences and engineering. The primary goal of the journal is to bridge the unique scientific and technical activities of the Circuits and Systems Society to a wide variety of related areas such as: • Bioelectronics • Implantable and wearable electronics like cochlear and retinal prosthesis, motor control, etc. • Biotechnology sensor circuits, integrated systems, and networks • Micropower imaging technology • BioMEMS • Lab-on-chip Bio-nanotechnology • Organic Semiconductors • Biomedical Engineering • Genomics and Proteomics • Neuromorphic Engineering • Smart sensors • Low power micro- and nanoelectronics • Mixed-mode system-on-chip • Wireless technology • Gene circuits and molecular circuits • System biology • Brain science and engineering: such as neuro-informatics, neural prosthesis, cognitive engineering, brain computer interface • Healthcare: information technology for biomedical, epidemiology, and other related life science applications. General, theoretical, and application-oriented papers in the abovementioned technical areas with a Circuits and Systems perspective are encouraged to publish in TBioCAS. Of special interest are biomedical-oriented papers with a Circuits and Systems angle.", "name": "Biomedical Circuits and Systems, IEEE Transactions on", "subjectList": ["Bioengineering", "Components, Circuits, Devices & Systems"], "influence": "1.032", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4156126", "eigen": "0.00578"}, {"impact": 0, "info": "The IEEE Reviews in Biomedical Engineering reviews the state-of-the-art and trends in the emerging field of biomedical engineering. This includes scholarly works, ranging from historic and modern development in biomedical engineering to the life sciences and medicine enabled by technologies covered by the various IEEE societies.", "name": "Biomedical Engineering, IEEE Reviews in", "subjectList": ["Bioengineering"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4664312", "eigen": 0}, {"impact": "4.288", "info": "Basic and applied papers dealing with biomedical engineering. Papers range from engineering development in methods and techniques with biomedical applications to experimental and clinical investigations with engineering contributions.\n\r\nIndexed in Pubmed® and Medline®, products of the United States National Library of Medicine\n    ", "name": "Biomedical Engineering, IEEE Transactions on", "subjectList": ["Bioengineering"], "influence": "1.052", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10", "eigen": "0.02378"}, {"impact": "3.85", "info": "J-BHI publishes original papers describing recent advances in the field of biomedical and health informatics where information and communication technologies intersect with health, healthcare, life sciences and biomedicine. Papers must contain original content in theoretical analysis, methods, technical development, and/or novel clinical applications of information systems. Topics covered by J-BHI include but are not limited to: acquisition, transmission, storage, retrieval, management, processing and analysis of biomedical and health information; applications of information and communication technologies in the practice of healthcare, public health, patient monitoring, preventive care, early diagnosis of diseases, discovery of new therapies, and patient specific treatment protocols leading to improved outcomes; and the integration of electronic medical and health records, methods of longitudinal data analysis, data mining and discovery tools. Manuscripts may deal with these applications and their integration, such as clinical information systems, decision support systems, medical and biological imaging informatics, wearable systems, body area/sensor networks, informatics in biological and physiological systems, personalized and pervasive health technologies (u-, p-, m- and e-Health), telemedicine, home healthcare and wellness management. Topics related to integration include interoperability, protocol-based patient care, evidence-based medicine, and methods of secure patient data.", "name": "Biomedical and Health Informatics, IEEE Journal of", "subjectList": ["Bioengineering", "Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Signal Processing & Analysis"], "influence": "0.855", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221020", "eigen": "0.0081"}, {"impact": "3.909", "info": "IEEE Transactions on Broadcasting covers the field of broadcast technology, including the production, distribution, transmission, and propagation aspects of broadcasting.", "name": "Broadcasting, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting"], "influence": "0.627", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=11", "eigen": "0.00315"}, {"impact": "3.558", "info": "IEEE Transactions on Circuits and Systems for Video Technology (TCSVT) covers the circuits and systems aspects of all video technologies. General, theoretical, and application-oriented papers with a circuits and systems perspective are encouraged for publication in TCSVT on or related to image/video acquisition, representation, presentation and display; processing, filtering and transforms; analysis and synthesis; learning and understanding; compression, transmission, communication and networking; storage, retrieval, indexing and search; and/or hardware and software design and implementation.", "name": "Circuits and Systems for Video Technology, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Signal Processing & Analysis"], "influence": "1.433", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=76", "eigen": "0.01662"}, {"impact": "2.823", "info": "TCAS I publishes regular papers in the field specified by the theory, analysis, design, and practical implementations of circuits, and the application of circuit techniques to systems and to signal processing. Included is the whole spectrum from basic scientific theory to industrial applications. The field of interest covered includes: - Circuits: Analog, Digital and Mixed Signal Circuits and Systems - Nonlinear Circuits and Systems, Integrated Sensors, MEMS and Systems on Chip, Nanoscale Circuits and Systems, Optoelectronic - Circuits and Systems, Power Electronics and Systems - Software for Analog-and-Logic Circuits and Systems - Control aspects of Circuits and Systems.", "name": "Circuits and Systems I: Regular Papers, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems"], "influence": "1.14", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8919", "eigen": "0.02206"}, {"impact": "2.45", "info": "TCAS II publishes brief papers in the field specified by the theory, analysis, design, and practical implementations of circuits, and the application of circuit techniques to systems and to signal processing. Included is the whole spectrum from basic scientific theory to industrial applications. The field of interest covered includes:", "name": "Circuits and Systems II: Express Briefs, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems"], "influence": "0.786", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8920", "eigen": "0.01116"}, {"impact": "3.933", "info": "The magazine covers the subject areas represented by the Society's transactions, including: analog, passive, switch capacitor, and digital filters; electronic circuits, networks, graph theory, and RF communication circuits; system theory; discrete, IC, and VLSI circuit design; multidimensional circuits and systems; large-scale systems and power networks; nonlinear circuits and systems, wavelets, filter banks, and applications; neural networks; and signal processing. Content also covers the areas represented by the Society technical committees: analog signal processing, cellular neural networks and array computing, circuits and systems for communications, computer-aided network design, digital signal processing, multimedia systems and applications, neural systems and applications, nonlinear circuits and systems, power systems and power electronics and circuits, sensors and micromaching, visual signal processing and communication, and VLSI systems and applications. Lastly, the magazine covers the interests represented by the widespread conference activity of the IEEE Circuits and Systems Society. In addition to the technical articles, the magazine also covers Society administrative activities, as for instance the meetings of the Board of Governors, Society People, as for instance the stories of award winners-fellows, medalists, and so forth, and Places reached by the Society, including readable reports from the Society's conferences around the world.", "name": "Circuits and Systems Magazine, IEEE", "subjectList": ["Components, Circuits, Devices & Systems"], "influence": "1.075", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7384", "eigen": "0.00106"}, {"impact": "7.928", "info": "The IEEE Transactions on Cloud Computing (TCC) is dedicated to the multidisciplinary field of cloud computing. It is committed to the publication of articles that present innovative research ideas, application results, and case studies in cloud computing, focusing on key technical issues related to theory, algorithms, systems, applications, and performance.", "name": "Cloud Computing, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "4.349", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245519", "eigen": "0.00413"}, {"impact": "2.723", "info": "The IEEE Communications Letters publishes short papers in a rapid publication cycle on advances in the state-of-the-art of communication over different media and channels including wire, underground, waveguide, optical fiber, and storage channels. Both theoretical contributions (including new techniques, concepts, and analyses) and practical contributions (including system experiments and prototypes, and new applications) are encouraged. This journal focuses on the physical layer and the link layer of communication systems.", "name": "Communications Letters, IEEE", "subjectList": ["Communication, Networking & Broadcasting"], "influence": "0.734", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4234", "eigen": "0.02895"}, {"impact": "9.27", "info": "\r\n\tIEEE Communications Magazine, considered by most to be their most important member benefit, provides timely information on all aspects of communications: monthly feature articles describe technology, systems, services, market trends, development methods, regulatory and policy issues, and significant global events. These articles are complemented by a variety of departments, including: Conference Calendar, Book Reviews, the Global Communications Newsletter, Scanning the Literature, New products and Product Spotlights, Society News, Your Internet Connection, News from JSAC, and the CommuniCrostic puzzle. Articles are tutorial in nature and written in a style comprehensible to readers outside the specialty of the article. Mathematical equations are generally not used (in justified cases up to three simple equations may be allowed with the consent of the Guest Editor. The inclusion of more than three equations requires permission from the Editor-in-Chief).", "name": "Communications Magazine, IEEE", "subjectList": ["Communication, Networking & Broadcasting"], "influence": "3.332", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=35", "eigen": "0.05644"}, {"impact": "20.23", "info": "IEEE Communications Surveys & Tutorials is an online journal published by the IEEE Communications Society for tutorials and surveys covering all aspects of the communications field. Telecommunications technology is progressing at a rapid pace, and the IEEE Communications Society is committed to providing researchers and other professionals the information and tools to stay abreast.  IEEE Communications Surveys and Tutorials focuses on integrating and adding understanding to the existing literature on communications, putting results in context. Whether searching for in-depth information about a familiar area or an introduction into a new area, IEEE Communications Surveys & Tutorials aims to be the premier source of peer-reviewed, comprehensive tutorials and surveys, and pointers to further sources. IEEE Communications Surveys & Tutorials publishes only articles exclusively written for IEEE Communications Surveys & Tutorials and go through a rigorous review process before their publication in the quarterly issues.\r\nA tutorial article in the IEEE Communications Surveys & Tutorials should be designed to help the reader to become familiar with and learn something specific about a chosen topic. In contrast, the term survey, as applied here, is defined to mean a survey of the literature. A survey article in IEEE Communications Surveys & Tutorials should provide a comprehensive review of developments in a selected area, covering its development from its inception to its current state and beyond, and illustrating its development through liberal citations from the literature. Both tutorials and surveys should be tutorial in nature and should be written in a style comprehensible to readers outside the specialty of the article.", "name": "Communications Surveys and Tutorials, IEEE Communications Society", "subjectList": ["Communication, Networking & Broadcasting"], "influence": "5.532", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9739", "eigen": "0.03576"}, {"impact": "4.671", "info": "The IEEE Transactions on Communications publishes high-quality manuscripts on advances in the state-of-the-art of all telecommunications including telephone, telegraphy, facsimile, and television, by electromagnetic propagation including radio; wire; aerial; underground, coaxial, and submarine cables; waveguides, communication satellites, and lasers; in marine, aeronautical, space and fixed station services; repeaters, radio relaying, signal storage, and regeneration; telecommunication error detection and correction; multiplexing and carrier techniques; communication switching systems; data communications; and communication theory.", "name": "Communications, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting"], "influence": "1.374", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=26", "eigen": "0.03774"}, {"impact": "1.66", "info": "IEEE Transactions on Components, Packaging, and Manufacturing Technology publishes research and application articles on modeling, design, building blocks, technical infrastructure, and analysis underpinning electronic, photonic and MEMS packaging, in addition to new developments in passive components, electrical contacts and connectors, thermal management, and device reliability; as well as the manufacture of electronics parts and assemblies, with broad coverage of design, factory modeling, assembly methods, quality, product robustness, and design-for-environment.", "name": "Components, Packaging and Manufacturing Technology, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas"], "influence": "0.424", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5503870", "eigen": "0.00649"}, {"impact": "2.428", "info": "IEEE/ACM Transactions on Computational Biology and Bioinformatics emphasizes the algorithmic, mathematical, statistical, and computational methods that are central in bioinformatics and computational biology; the development and testing of effective computer programs in bioinformatics; the development of biological databases; and important biological results that are obtained from the use of these methods, programs and databases; the emerging field of Systems Biology, where many forms of data are used to create a computer-based model of a complex biological system. The publication represents a mixture of three research modalities: a) fundamental methodological, algorithmic, mathematical and statistical research directly motivated by biological issues; b) papers focusing on experimental and implementation issues; and c) papers on serious application of methods and programs that lead to discoveries of biological significance. Increasingly, papers contain elements of all three modalities. Specific topics of interest include, but are not limited to, sequence analysis, comparison and alignment methods; motif, gene and signal recognition; molecular evolution; phylogenetics and phylogenomics; determination or prediction of the structure of RNA and Protein in two and three dimensions; DNA twisting and folding; gene expression and gene regulatory networks; deduction of metabolic pathways; micro-array design and analysis; proteomics; functional genomics; molecular docking and drug design; computational problems in genetics such as linkage and QTL analysis, linkage disequilibrium analysis in populations, and haplotype determination; systems biology. ", "name": "Computational Biology and Bioinformatics, IEEE/ACM Transactions on", "subjectList": ["Bioengineering", "Computing & Processing"], "influence": "0.708", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8857", "eigen": "0.00641"}, {"impact": "1.94", "info": "\nComputer, the flagship publication of the IEEE Computer Society, publishes peer-reviewed articles written for and by computer researchers and practitioners representing the full spectrum of computing and information technology, from hardware to software and from emerging research to new applications. The aim is to provide more technical substance than trade magazines and more practical ideas than research journals. Computer seeks to deliver useful information for all computing professionals and students, including computer scientists, engineers, and practitioners of all levels.", "name": "Computer", "subjectList": ["Computing & Processing"], "influence": "0.703", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=2", "eigen": "0.00582"}, {"impact": "1.64", "info": "\r\n\tIEEE CG&A bridges the theory and practice of computer graphics. From specific algorithms to full system implementations, CG&A offers a unique combination of peer-reviewed feature articles and informal departments, including product announcements. Special applications sidebars relate research stories to commercial development. A cover story focuses on creative applications of the technology by an artist or designer. Published six times a year, CG&A is indispensable reading for people working at the leading edge of computer graphics technology and its applications in everything from business to the arts.", "name": "Computer Graphics and Applications Magazine, IEEE", "subjectList": ["Computing & Processing"], "influence": "0.576", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=38", "eigen": "0.00165"}, {"impact": "0.897", "info": "The IEEE Transactions on Computational Intelligence and AI in Games (T-CIAIG) publishes archival journal quality original papers in computational intelligence and related areas in artificial intelligence applied to games, including but not limited to videogames, mathematical games, human–computer interactions in games, and games involving physical objects. Emphasis is placed on the use of these methods to improve performance in and understanding of the dynamics of games, as well as gaining insight into the properties of the methods as applied to games. It also includes using games as a platform for building intelligent embedded agents for the real world. Papers connecting games to all areas of computational intelligence and traditional AI are considered.", "name": "Computational Intelligence and AI in Games, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "0.575", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4804728", "eigen": "0.00119"}, {"impact": 0, "info": "", "name": "Computational Intelligence Magazine, IEEE", "subjectList": [], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/tocresult.jsp?isnumber=33585", "eigen": 0}, {"impact": 0, "info": "IEEE Transactions on Computational Social Systems focuses on such topics as modeling, simulation, analysis and understanding of social systems from the quantitative and/or computational perspective. \"Systems\" include man-man, man-machine and machine-machine organizations and adversarial situations as well as social media structures and their dynamics. More specifically, the proposed transactions publishes articles on modeling the dynamics of social systems, methodologies for incorporating and representing socio-cultural and behavioral aspects in computational modeling, analysis of social system behavior and structure, and paradigms for social systems modeling and simulation. The journal also features articles on social network dynamics, social intelligence and cognition, social systems design and architectures, socio-cultural modeling and representation, and computational behavior modeling, and their applications.", "name": "Computational Social Systems, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing", "General Topics for Engineers"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6570650", "eigen": 0}, {"impact": "1.521", "info": "IEEE Computer Architecture Letters is a rigorously peer-reviewed forum for publishing early, high-impact results in the areas of uni- and multiprocessor computer systems, computer architecture, microarchitecture, workload characterization, performance evaluation and simulation techniques, and power-aware computing. Submissions are welcomed on any topic in computer architecture, especially but not limited to: microprocessor and multiprocessor systems, microarchitecture and ILP processors,  workload characterization, performance evaluation and simulation techniques, compiler-hardware and operating system-hardware interactions, interconnect architectures, memory and cache systems, power and thermal issues at the architecture level, I/O architectures and techniques, independent validation of previously published results, analysis of unsuccessful techniques,  domain-specific processor architectures (e.g., embedded, graphics, network, etc.), real-time and high-availability architectures, reconfigurable systems.", "name": "Computer Architecture Letters, IEEE", "subjectList": ["Computing & Processing"], "influence": "0.48", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10208", "eigen": "0.00087"}, {"impact": "2.089", "info": "", "name": "Computer-Aided Design of Integrated Circuits and Systems, IEEE Transactions on", "subjectList": [], "influence": "0.616", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=43", "eigen": "0.00708"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=12", "name": "Computers, IEEE Transactions on"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=38", "name": "Computer Graphics & Applications, IEEE"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5992", "name": "Computing in Science & Engineering Magazine, IEEE"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962380", "name": "Consumer Electronics Magazine, IEEE"}, {"impact": "1.802", "info": "The main focus for the IEEE Transactions on Consumer Electronics is the engineering and research aspects of the theory, design, construction, manufacture or end use of mass market electronics, systems, software and services for consumers.", "name": "Consumer Electronics, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Fields, Waves & Electromagnetics", "Power, Energy, & Industry Applications"], "influence": "0.397", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=30", "eigen": "0.00295"}, {"impact": 0, "info": "The IEEE Transactions on Control of Network Systems is committed to the timely publication of high-impact papers at the intersection of control systems and network science. In particular, the journal addresses research on the analysis, design and implementation of networked control systems, as well as control over networks. Relevant work includes the full spectrum from basic research on control systems to the design of engineering solutions for automatic control of, and over, networks. The topics covered by this journal include: Coordinated control and estimation over networks, Control and computation over sensor networks, Control under communication constraints, Control and performance analysis issues that arise in the dynamics of networks used in application areas such as communications, computers, transportation, manufacturing, Web ranking and aggregation, social networks, biology, power systems, economics, Synchronization of activities across a controlled network, Stability analysis of controlled networks, Analysis of networks as hybrid dynamical systems.", "name": "Control and Network Systems, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6509490", "eigen": 0}, {"impact": "4.883", "info": "The IEEE Transactions on Control Systems Technology publishes high quality technical papers on technological advances in control engineering. The word technology is from the Greek technologia. The modern meaning is a scientific method to achieve a practical purpose. Control Systems Technology includes all aspects of control engineering needed to implement practical control systems, from analysis and design, through simulation and hardware. A primary purpose of the IEEE Transactions on Control Systems Technology is to have an archival publication which will bridge the gap between theory and practice. Papers are published in the IEEE Transactions on Control System Technology which disclose significant new knowledge, exploratory developments, or practical applications in all aspects of technology needed to implement control systems, from analysis and design through simulation, and hardware. ", "name": "Control Systems Technology, IEEE Transactions on", "subjectList": ["Signal Processing & Analysis"], "influence": "1.525", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=87", "eigen": "0.02188"}, {"impact": "3.661", "info": "\r\n\tIEEE Control Systems Magazine is the official means of communication for the IEEE Control Systems Society. IEEE Control Systems Magazine publishes interesting, useful, and informative material on all aspects of control system technology for the benefit of control educators, practitioners, and researchers. With this mission statement in mind, IEEE Control Systems Magazine encourages submissions, both feature articles and columns, on all aspects of control system technology.", "name": "Control Systems Magazine, IEEE", "subjectList": ["Signal Processing & Analysis"], "influence": "2.211", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=37", "eigen": "0.00552"}, {"impact": "8.803", "info": "The scope of the IEEE Transactions on Cybernetics includes computational approaches to the field of cybernetics. Specifically, the transactions welcomes papers on communication and control across machines or machine, human, and organizations. The scope includes such areas as computational intelligence, computer vision, neural networks, genetic algorithms,  machine learning, fuzzy systems, cognitive systems, decision making, and robotics, to the extent that they contribute to the theme of cybernetics or demonstrate an application of cybernetics principles.", "name": "Cybernetics, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "General Topics for Engineers", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": "2.572", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221036", "eigen": "0.03272"}, {"impact": "4.41", "info": "The purpose of TDSC is to publish papers in dependability and security, including the joint consideration of these issues and their interplay with system performance. These areas include but are not limited to: System Design: architecture for secure and fault-tolerant systems; trusted/survivable computing; intrusion and error tolerance, detection and recovery; fault- and intrusiontolerant middleware; firewall and network technologies; system management and administration; Evaluation: modeling and prediction; survivability and performability modeling; solution techniques; experimental methods including test-bed design, automated fault/attack generation, monitoring, measurement and analysis, workload characterization, benchmarking, and quality of service assessment; Applications: transaction processing; distributed and pervasive systems; electronic commerce; real-time systems; safety-critical systems; embedded systems; Internet applications; Software Design: operating system support for detection and recovery; selfchecking; fault tolerance techniques; network interfaces and protocols; testing, validation, verification; aging and rejuvenation; reliability and performance. Emerging Technologies: nanoscale computing; mobile computing; wireless telephony; satellite networks; data mining; wearable computers; multimedia applications; signal processing; quantum computing.", "name": "Dependable and Secure Computing, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "1.208", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8858", "eigen": "0.00407"}, {"impact": 0, "info": "\nIEEE Design & Test of Computers offers original works describing the methods used to design and test electronic product hardware and supportive software. The magazine focuses on current and near-future practice, and includes tutorials, how-to articles, and real-world case studies. Topics include IC/module design, low-power design, electronic design automation, design/test verification, practical technology, and standards. IEEE Design & Test of Computers is published by the IEEE Computer Society in technical cosponsorship with the IEEE Circuits and Systems Society.", "name": "Design & Test of Computers, IEEE", "subjectList": ["Computing & Processing"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=54", "eigen": 0}, {"impact": "1.512", "info": "The scope of the publication includes, but is not limited to Reliability of: Devices, Materials, Processes, Interfaces, Integrated Microsystems (including MEMS & Sensors), Transistors, Technology (CMOS, BiCMOS, etc.), Integrated Circuits (IC, SSI, MSI, LSI, ULSI, ELSI, etc.), Thin Film Transistor Applications. The measurement and understanding of the reliability of such entities at each phase, from the concept stage through research and development and into manufacturing scale-up, provides the overall database on the reliability of the devices, materials, processes, package and other necessities for the successful introduction of a product to market. This reliability database is the foundation for a quality product, which meets customer expectation. A product so developed has high reliability. High quality will be achieved because product weaknesses will have been found (root cause analysis) and designed out of the final product. This process of ever increasing reliability and quality will result in a superior product. In the end, reliability and quality are not one thing; but in a sense everything, which can be or has to be done to guarantee that the product successfully performs in the field under customer conditions. Our goal is to capture these advances. An additional objective is to focus cross fertilized communication in the state of the art of reliability of electronic materials and devices and provide fundamental understanding of basic phenomena that affect reliability. In addition, the publication is a forum for interdisciplinary studies on reliability. An overall goal is to provide leading edge/state of the art information, which is critically relevant to the creation of reliable products.", "name": "Device and Materials Reliability, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas"], "influence": "0.512", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7298", "eigen": "0.00327"}, {"impact": "1.774", "info": "\nAims", "name": "Dielectrics and Electrical Insulation, IEEE Transactions on", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics"], "influence": "0.316", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=94", "eigen": "0.0075"}, {"impact": "1.530", "info": "\r\n\tThe scope of the Journal of Display Technology is the theory, design, fabrication, manufacturing and application of information displays and aspects of displays technology that emphasize the progress in device engineering, device design, materials, electronics, physics and reliability aspects of displays and the application of displays.", "name": "Display Technology, IEEE/OSA Journal of", "subjectList": ["Photonics & Electro-Optics"], "influence": "0.400", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9425", "eigen": "0.00381"}, {"impact": "1.6", "info": "The IEEE Transactions on Education (ToE) publishes significant and original scholarly contributions to education in electrical and electronics engineering, computer engineering, computer science, and other fields within the scope of interest of IEEE. Contributions must address discovery, integration, and/or application of knowledge in education in these fields. Articles must support contributions and assertions with compelling evidence and provide explicit, transparent descriptions of the processes through which the evidence is collected, analyzed, and interpreted. While characteristics of compelling evidence cannot be described to address every conceivable situation, generally assessment of the work being reported must go beyond student self-report and attitudinal data.", "name": "Education, IEEE Transactions on", "subjectList": ["Engineering Profession", "General Topics for Engineers"], "influence": "0.404", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=13", "eigen": "0.0013"}, {"impact": "0.973", "info": "The Canadian Journal of Electrical and Computer Engineering, issued quarterly, has been publishing high-quality refereed scientific papers in all areas of electrical and computer engineering since 1976.\r\nSponsored by IEEE Canada (The Institute of Electrical and Electronics Engineers, Inc., Canada) as a part of its role to provide scientific and professional activity for its members in Canada, the CJECE complements international journals and will be of particular interest to anyone involved in research and development activities in the field of electrical and computer engineering.", "name": "Electrical and Computer Engineering, Canadian Journal of", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics"], "influence": "0.267", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9754", "eigen": "0.00043"}, {"impact": 0, "info": "IEEE Electrification Magazine is dedicated to disseminating information on all matters related to microgrids onboard electric vehicles, ships, trains, planes, and off-grid applications. Microgrids refer to an electric network in a car, a ship, a plane or an electric train, which has a limited number of sources and multiple loads. Off-grid applications include small scale electricity supply in areas away from high voltage power networks. Feature articles focus on advanced concepts, technologies, and practices associated with all aspects of electrification in the transportation and off-grid sectors from a technical perspective in synergy with nontechnical areas such as business, environmental, and social concerns.", "name": "Electrification Magazine, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Fields, Waves & Electromagnetics", "Power, Energy, & Industry Applications"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6508996", "eigen": 0}, {"impact": "1.52", "info": "IEEE Transactions on Electromagnetic Compatibility publishes original and significant contributions related to all disciplines of electromagnetic compatibility (EMC) and relevant methods to predict, assess and prevent electromagnetic interference (EMI) and increase device/product immunity. The scope of the publication includes, but is not limited to Electromagnetic Environments; Interference Control; EMC and EMI Modeling; High Power Electromagnetics; EMC Standards, Methods of EMC Measurements; Computational Electromagnetics and Signal and Power Integrity, as applied or directly related to Electromagnetic Compatibility problems; Transmission Lines; Electrostatic Discharge and Lightning Effects; EMC in Wireless and Optical Technologies; EMC in Printed Circuit Board and System Design.", "name": "Electromagnetic Compatibility, IEEE Transactions on", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics"], "influence": "0.329", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=15", "eigen": "0.00418"}, {"impact": 0, "info": "\n IEEE Electromagnetic Compatibility Magazine informs readers of activities in the IEEE EMC Society and educates members via practical technical papers and design tips.", "name": "Electromagnetic Compatibility Magazine, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Fields, Waves & Electromagnetics"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962381", "eigen": 0}, {"impact": "3.433", "info": "IEEE Electron Device Letters publishes original and significant contributions relating to the theory, modeling, design, performance and reliability of electron and ion integrated circuit devices and interconnects, involving insulators, metals, organic materials, micro-plasmas, semiconductors, quantum-effect structures, vacuum devices, and emerging materials with applications in bioelectronics, biomedical electronics, computation, communications, displays, microelectromechanics, imaging, micro-actuators, nanoelectronics, optoelectronics, photovoltaics, power ICs and micro-sensors.", "name": "Electron Device Letters, IEEE", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas"], "influence": "0.785", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=55", "eigen": "0.02376"}, {"impact": "2.62", "info": "IEEE Transactions on Electron Devices publishes original and significant contributions relating to the theory, modeling, design, performance and reliability of electron and ion integrated circuit devices and interconnects, involving insulators, metals, organic materials, micro-plasmas, semiconductors, quantum-effect structures, vacuum devices, and emerging materials with applications in bioelectronics, biomedical electronics, computation, communications, displays, microelectromechanics, imaging, micro-actuators, nanoelectronics, optoelectronics, photovoltaics, power ICs and micro-sensors. Tutorial and review papers on these subjects are also published and occasional special issues appear to present a collection of papers which treat particular areas in more depth and breadth. ", "name": "Electron Devices, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas"], "influence": "0.639", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=16", "eigen": "0.02763"}, {"impact": "1.764", "info": "The EI Magazine publishes articles written by authors from industry, research institutes and academia. The articles are more practical in content than the papers published in the Transactions. Usually three articles are published in each issue. The articles deal with dielectric materials, processes and new developments applied to industry products. Also the EI Magazine is used to promote upcoming conferences and solicits papers for the conferences. In addition, reports on past conferences are given in many issues. Book reviews and news items are included. An editorial is written by both the EIC and the President of DEIS in alternate issues. Advertising of insulation products appears in many issues.", "name": "Electrical Insulation Magazine, IEEE", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics"], "influence": "0.735", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=57", "eigen": "0.00153"}, {"impact": 0, "info": "\r\n\tForum for rapid dissemination of the results of original research in electronic materials. Includes materials for memory, logic, display, interconnections, detectors, emitters, packaging, large stores and hard copy. General papers on electronic materials for device application, structure making, reliability and yield.", "name": "Electronic Materials, IEEE/TMS Journal of", "subjectList": [], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7029", "eigen": 0}, {"impact": 0, "info": "The IEEE Embedded Systems Letters (ESL), provides a forum for rapid dissemination of latest technical advances in embedded systems and related areas in embedded software. The emphasis is on models, methods, and tools that ensure secure, correct, efficient and robust design of embedded systems and their applications.", "name": "Embedded Systems Letters, IEEE", "subjectList": ["Computing & Processing"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4563995", "eigen": 0}, {"impact": "3.218", "info": "The IEEE Journal on Emerging and Selected Topics in Circuits and Systems publishes special issues covering the entire Field of Interest of the IEEE Circuits and Systems Society and with particular focus on emerging areas. ", "name": "Emerging and Selected Topics in Circuits and Systems, IEEE Journal of", "subjectList": ["Components, Circuits, Devices & Systems"], "influence": "1.196", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5503868", "eigen": "0.00438"}, {"impact": "3.626", "info": "IEEE Transactions on Emerging Topics in Computing publishes papers on emerging aspects of computer science, computing technology, and computing applications not currently covered by other IEEE Computer Society Transactions. Some examples of emerging topics in computing include: IT for Green, Synthetic and organic computing structures and systems, Advanced analytics, Social/occupational computing, Location-based/client computer systems, Morphic computer design, Electronic game systems, & Health-care IT.", "name": "Emerging Topics on Computing, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "1.155", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245516", "eigen": "0.00256"}, {"impact": "5.177", "info": "The aim of the journal is to enable the power electronics community to address the emerging and selected topics in power electronics in an agile fashion. It is a forum where multidisciplinary and discriminating technologies and applications are discussed by and for both practitioners and researchers on timely topics in power electronics from components to systems.", "name": "Emerging and Selected Topics in Power Electronics, IEEE Journal of", "subjectList": ["Components, Circuits, Devices & Systems", "Power, Energy, & Industry Applications"], "influence": "1.892", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245517", "eigen": "0.00996"}, {"impact": "3.767", "info": "The IEEE Transactions on Energy Conversion includes in its venue the research, development, design, application, construction, installation, operation, analysis and control of electric power generating and energy storage equipment (along with conventional, cogeneration, nuclear, distributed or renewable sources, central station and grid connection). The scope also includes electromechanical energy conversion, electric machinery, devices, systems and facilities for the safe, reliable, and economic generation and utilization of electrical energy for general industrial, commercial, public, and domestic consumption of electrical energy.", "name": "Energy Conversion, IEEE Transactions on", "subjectList": ["Power, Energy, & Industry Applications"], "influence": "1.351", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=60", "eigen": "0.01243"}, {"impact": "1.416", "info": "Management of technical functions such as research, development, and engineering in industry, government, university, and other settings. Emphasis is on studies carried on within an organization to help in decision making or policy formation for RD&E. ", "name": "Engineering Management, IEEE Transactions on", "subjectList": ["Engineering Profession"], "influence": "0.474", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17", "eigen": "0.00173"}, {"impact": 0, "info": "The IEEE Engineering Management Review, the the Society's \"journal of practice,\" republishes papers and articles and includes original content that serves those who manage technology, engineering and innovation (including non-engineers); engineers who hold strategic leadership responsibilities (even if outside of the practice of engineering); and upward-bound engineers with an interest in management as a profession.", "name": "Engineering Management Review, IEEE", "subjectList": ["Engineering Profession"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=46", "eigen": 0}, {"impact": "8.124", "info": "IEEE Transactions on Evolutionary Computation publishes archival quality original papers in evolutionary computation and related areas including nature-inspired algorithms, population-based methods, and optimization where selection and variation are integral, and hybrid systems where these paradigms are combined. Purely theoretical papers are considered as are application papers that provide general insights into these areas of computation.", "name": "Evolutionary Computation, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "2.264", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4235", "eigen": "0.00883"}, {"impact": "8.415", "info": "The IEEE Transactions on Fuzzy Systems publishes high quality technical papers in the theory, design and application of fuzzy systems. Readers are encouraged to submit papers which disclose significant technical knowledge, exploratory developments and applications of fuzzy systems. Emphasis is given to engineering systems and scientific applications. The Transactions also contains a letters section which includes information of current interest, and comments and rebuttals submitted in connection with published papers.", "name": "Fuzzy Systems, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "2.432", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=91", "eigen": "0.02128"}, {"impact": "2.892", "info": "IEEE Geoscience and Remote Sensing Letters (GRSL) is a monthly publication for short papers (maximum length 5 pages) addressing new ideas and formative concepts in remote sensing as well as important new and timely results and concepts. Papers should relate to the theory, concepts and techniques of science and engineering as applied to sensing the earth, oceans, atmosphere, and space, and the processing, interpretation, and dissemination of this information. The technical content of papers must be both new and significant. Experimental data must be complete and include sufficient description of experimental apparatus, methods, and relevant experimental conditions. GRSL encourages the incorporation of \"extended objects\" or \"multimedia\" such as animations to enhance the shorter papers.", "name": "Geoscience and Remote Sensing Letters, IEEE", "subjectList": ["Geoscience"], "influence": "0.786", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8859", "eigen": "0.02058"}, {"impact": "4.932", "info": "The IEEE Geoscience and Remote Sensing Magazine informs readers of activities in the IEEE GRS Society, its technical committees and chapters. GRSM also informs and educates readers via technical papers, provides information on international remote sensing activities and new satellite missions, publishes contributions on education activities, industrial and university profiles, conference news, book reviews, and a calendar of important events.", "name": "Geoscience and Remote Sensing Magazine, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Geoscience", "Power, Energy, & Industry Applications", "Signal Processing & Analysis"], "influence": "2.01", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245518", "eigen": "0.00204"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=36", "name": "Geoscience and Remote Sensing, IEEE Transactions on"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4543165", "name": "Haptics, IEEE Transactions on"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221037", "name": "Human-Machine Systems, IEEE Transactions on"}, {"href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=83", "name": "Image Processing, IEEE Transactions on"}, {"impact": "7.05", "info": "IEEE Transactions on Industrial Electronics is published monthly. Its scope encompasses the applications of electronics, controls and communications, instrumentation and computational intelligence for the enhancement of industrial and manufacturing systems and processes. Included are power electronics and drive control techniques, system control and signal processing, fault detection and diagnosis, power systems, instrumentation, measurement and testing, modeling and simulation, motion control, robotics, sensors and actuators, implementation of neural nets, fuzzy logic, and artificial intelligence in industrial systems, factory automation, communication, and computer networks.", "name": "Industrial Electronics, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Power, Energy, & Industry Applications", "Signal Processing & Analysis"], "influence": "2.025", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=41", "eigen": "0.0903"}, {"impact": "10.429", "info": "IEEE Industrial Electronics Magazine (IEM) publishes peer-reviewed articles that present emerging trends and practices in industrial electronics product research and development, key insights, and tutorial surveys in the field of interest to the membership of the IEEE Industrial Electronics Society (IEEE/IES). IEM is limited to the scope of the IES which is given as theory and applications of electronics, controls, communications, instrumentation and computational intelligence to industrial and manufacturing systems and processes.", "name": "Industrial Electronics Magazine, IEEE", "subjectList": ["Power, Energy, & Industry Applications", "Signal Processing & Analysis"], "influence": "3.472", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4154573", "eigen": "0.00368"}, {"impact": "5.43", "info": "Knowledge in the IST (Information Society Technologies) field envisions a technology bifurcation in the field of intelligent automation systems and real-time middle-ware technologies in the next 5-10 years. This technology bifurcation extends networked embedded intelligence at the real-time production control and re-scheduling levels further than is currently possible, allowing for a completely new range of intelligent automation products and services. Such products and services enables new paradigms of production and new concepts of product-services and new intelligent production automation concepts, which are more agile, flexible and integrated, based on agent-based technology. The scope of the journal considers the industry’s transition towards more knowledge-based production and systems organization and considers production from a more holistic perspective, encompassing not only hardware and software, but also people and the way in which they learn and share knowledge. Such a framework accommodates ideas related to: radical shifts in industrial structures with capabilities in networks and mastering; new hybrid technologies; development of new processes and devices and flexible and intelligent manufacturing systems; tools for the control of complex distributed production systems; realization of an ambient intelligence landscape at industrial level. The journal focuses on the following main topics: Flexible, collaborative factory automation, Distributed industrial control and computing paradigms, Internet-based monitoring and control systems, Real-time control software for industrial processes, Java and Jini in industrial environments, Control of wireless sensors and actuators, Systems interoperability and human machine interface.", "name": "Industrial Informatics, IEEE Transactions on", "subjectList": [], "influence": "1.801", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424", "eigen": "0.02301"}, {"impact": "2.743", "info": "The scope of the IEEE Transactions on Industry Applications includes all scope items of the IEEE Industry Applications Society, that is, the advancement of the theory and practice of electrical and electronic engineering in the development, design, manufacture, and application of electrical systems, apparatus, devices, and controls to the processes and equipment of industry and commerce; the promotion of safe, reliable, and economic installations; industry leadership in energy conservation and environmental, health, and safety issues; the creation of voluntary engineering standards and recommended practices; and the professional development of its membership.", "name": "Industry Applications, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Fields, Waves & Electromagnetics", "Power, Energy, & Industry Applications", "Signal Processing & Analysis"], "influence": "0.912", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=28", "eigen": "0.02537"}, {"impact": "0.864", "info": "IEEE Industry Applications Magazine publishes articles concerning technical subjects and professional activities that are within the Scope of the IEEE Industry Applications Society (IAS) and are of interest to society members. The information includes but is not limited to articles, product reviews, book reviews, new standards, education information, announcements of conferences, workshops, new publications, committee meetings, and reports of lAS activities. The Magazine communicates Executive Board actions to IAS members as required by the IAS Constitution and By-Laws.", "name": "Industry Applications Magazine, IEEE", "subjectList": ["Power, Energy, & Industry Applications", "Signal Processing & Analysis"], "influence": "0.302", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=2943", "eigen": "0.00092"}, {"impact": "5.824", "info": "The IEEE Transactions on Information Forensics and Security covers the sciences, technologies, and applications relating to information forensics, information security, biometrics, surveillance and systems applications that incorporate these features.", "name": "Information Forensics and Security, IEEE Transactions on", "subjectList": [], "influence": "1.565", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10206", "eigen": "0.01991"}, {"impact": "2.493", "info": "\r\n\tThe IEEE Transactions on Information Technology in Biomedicine publishes basic and applied papers of information technology applications in health, healthcare and biomedicine covering any of the following topics: Personalized and pervasive health technologies (u-, p-, m- and eHealth), electronic health record, interoperability and connectivity, regional and community health information networks, hospital information systems, PACS, disease management systems, CPOE, telemedicine, knowledge management, decision support systems, virtual reality applications, visualisation and biomedical imaging technologies, usability, privacy, security, semantic web, Grids in biomedicine, systems biology, ethical and legal and educational issues.\n\r\n\tIndexed in Pubmed® and Medline®, products of the United States National Laboratory of Medicine\n    ", "name": "Information Technology in Biomedicine, IEEE Transactions on", "subjectList": ["Bioengineering", "Computing & Processing"], "influence": "0.785", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4233", "eigen": "0.00668"}, {"impact": "2.187", "info": "The IEEE Transactions on Information Theory is a journal that publishes theoretical and experimental papers concerned with the transmission, processing, and utilization of information. The boundaries of acceptable subject matter are intentionally not sharply delimited. Rather, it is hoped that as the focus of research activity changes, a flexible policy will permit this Transactions to follow suit. Current appropriate topics are best reflected by recent Tables of Contents; they are summarized in the titles of editorial areas that appear on the inside front cover.", "name": "Information Theory, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Signal Processing & Analysis"], "influence": "1.132", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=18", "eigen": "0.03855"}, {"impact": "2.794", "info": "Papers are sought that address innovative solutions to the development and use of electrical and electronic instruments and equipment to measure, monitor and/or record physical phenomena for the purpose of advancing measurement science, methods, functionality and applications. The scope of these papers may encompass: (1) theory, methodology, and practice of measurement; (2) design, development and evaluation of instrumentation and measurement systems and components used in generating, acquiring, conditioning and processing signals; (3) analysis, representation, display, and preservation of the information obtained from a set of measurements; and (4) scientific and technical support to establishment and maintenance of technical standards in the field of Instrumentation and Measurement.", "name": "Instrumentation and Measurement, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Power, Energy, & Industry Applications"], "influence": "0.668", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=19", "eigen": "0.0158"}, {"impact": "1.895", "info": "\nIEEE Instrumentation & Measurement Magazine is a bimonthly publication. It publishes in February, April, June, August, October, and December of each year. The magazine covers a wide variety of topics in instrumentation, measurement, and systems that measure or instrument equipment or other systems. The magazine has the goal of providing readable introductions and overviews of technology in instrumentation and measurement to a wide engineering audience. It does this through articles, tutorials, columns, and departments. Its goal is to cross disciplines to encourage further research and development in instrumentation and measurement.", "name": "Instrumentation and Measurement Magazine, IEEE", "subjectList": ["Components, Circuits, Devices & Systems", "Power, Energy, & Industry Applications"], "influence": "0.332", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5289", "eigen": "0.00089"}, {"impact": "2.596", "info": "\r\n\tIEEE Intelligent Systems serves users, managers, developers, researchers, and purchasers who are interested in intelligent systems and artificial intelligence, with particular emphasis on applications. Typically they are degreed professionals, with backgrounds in engineering, hard science, or business. The publication emphasizes current practice and experience, together with promising new ideas that are likely to be used in the near future. Sample topic areas for feature articles include knowledge-based systems, intelligent software agents, natural-language processing, technologies for knowledge management, machine learning, data mining, adaptive and intelligent robotics, knowledge-intensive processing on the Web, and social issues relevant to intelligent systems. Also encouraged are application features, covering practice at one or more companies or laboratories; full-length product stories (which require refereeing by at least three reviewers); tutorials; surveys; and case studies. Often issues are theme-based and collect articles around a contemporary topic under the auspices of a Guest Editor working with the EIC.", "name": "Intelligent Systems, IEEE", "subjectList": ["Computing & Processing", "Signal Processing & Analysis"], "influence": "1.048", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9670", "eigen": "0.00348"}, {"impact": "4.051", "info": "The theoretical, experimental and operational aspects of electrical and electronics engineering and information technologies as applied to Intelligent Transportation Systems (ITS). Intelligent Transportation Systems are defined as those systems utilizing synergistic technologies and systems engineering concepts to develop and improve transportation systems of all kinds. The scope of this interdisciplinary activity includes the promotion, consolidation and coordination of ITS technical activities among IEEE entities, and providing a focus for cooperative activities, both internally and externally.", "name": "Intelligent Transportation Systems, IEEE Transactions on", "subjectList": ["Transportation"], "influence": "1.11", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6979", "eigen": "0.01809"}, {"impact": "3.019", "info": "The IEEE Intelligent Transportation Systems Magazine (ITSM) publishes peer-reviewed articles that provide innovative research ideas and application results, report significant application case studies, and raise awareness of pressing research and application challenges in all areas of intelligent transportation systems. In contrast to the highly academic publication of the IEEE Transactions on Intelligent Transportation Systems, the ITS Magazine focuses on providing needed information to all members of IEEE ITS society, serving as a dissemination vehicle for ITS Society members and the others to learn the state of the art development and progress on ITS research and applications. High quality tutorials, surveys, successful implementations, technology reviews, lessons learned, policy and societal impacts, and ITS educational issues are published as well. The ITS Magazine also serves as an ideal media communication vehicle between the governing body of ITS society and its membership and promotes ITS community development and growth.", "name": "Intelligent Transportation Systems Magazine, IEEE", "subjectList": ["Transportation"], "influence": "0.931", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5117645", "eigen": "0.00151"}, {"impact": "5.863", "info": "IEEE Internet of Things (IoT) Journal publishes articles on the latest advances, as well as review articles, on the various aspects of IoT. Topics include IoT system architecture, IoT enabling technologies, IoT communication and networking protocols such as network coding, and IoT services and applications. Examples are IoT demands, impacts, and implications on sensors technologies, big data management, and future Internet design for various IoT use cases, such as smart cities, smart environments, smart homes, etc. The fields of interest include: IoT architecture such as things-centric, data-centric, service-oriented IoT architecture; IoT enabling technologies and systematic integration such as sensor technologies, big sensor data management, and future Internet design for IoT; IoT services, applications, and test-beds such as IoT service middleware, IoT application programming interface (API), IoT application design, and IoT trials/experiments; IoT standardization activities and technology development in different standard development organizations (SDO) such as IEEE, IETF, ITU, 3GPP, ETSI, etc.", "name": "Internet Of Things Journal, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing"], "influence": "2.056", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "eigen": "0.00663"}, {"impact": "1.929", "info": "\r\n\tThis magazine provides a journal-quality evaluation and review of Internet-based computer applications and enabling technologies. It also provides a source of information as well as a forum for both users and developers. The focus of the magazine is on Internet services using WWW, agents, and similar technologies. This does not include traditional software concerns such as object-oriented or structured programming, or Common Object Request Broker Architecture (CORBA) or Object Linking and Embedding (OLE) standards. The magazine may, however, treat the intersection of these software technologies with the Web or agents. For instance, the linking of ORBs and Web servers or the conversion of KQML messages to object requests are relevant technologies for this magazine. An article strictly about CORBA would not be. This magazine is not focused on intelligent systems. Techniques for encoding knowledge or breakthroughs in neural net technologies are outside its scope, as would be an article on the efficacy of a particular expert system. Internet Computing focuses on technologies and applications that allow practitioners to leverage off services to be found on the Internet. Agents are one technology for doing so, independent of claims about intelligence. In fact, most of the useful agent technology being deployed on the Internet is distinct from the multi-user agent technology developed in the AI world. The latter typically focuses on architectures supporting beliefs, intentions, and other human-like characteristics. Such characteristics are typically not relevant to Internet agents. More important are system engineering issues such as Internet mobility, shared protocols, ontologies, registration, and routing. Network software and hardware per se are not in the scope of this magazine. On the other hand, hardware that permits faster execution of a specific Web technology, such as Java chips, would be covered.", "name": "Internet Computing, IEEE", "subjectList": ["Computing & Processing"], "influence": "0.873", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4236", "eigen": "0.00353"}, {"impact": "1.618", "info": "IT Professional is a technical magazine of the IEEE Computer Society. It publishes peer-reviewed articles, columns and departments written for and by IT practitioners and researchers covering:\r\n• practical aspects of emerging and leading-edge digital technologies,\r\n• original ideas and guidance for IT applications, and\r\n• novel IT solutions for the enterprise.\r\nIT Professional’s goal is to inform the broad spectrum of IT executives, IT project managers, IT researchers, and IT application developers from industry, government, and academia.", "name": "IT Professional", "subjectList": ["Components, Circuits, Devices & Systems", "Computing & Processing", "Engineering Profession", "Power, Energy, & Industry Applications"], "influence": "0.424", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6294", "eigen": "0.00109"}, {"impact": "2.775", "info": "The scope includes the knowledge and data engineering aspects of computer science, artificial intelligence, electrical engineering, computer engineering, and other appropriate fields. This Transactions provides an international and interdisciplinary forum to communicate results of new developments in knowledge and data engineering and the feasibility studies of these ideas in hardware and software. Specific areas to be covered are as follows: Fields and Areas of Knowledge and Data Engineering: (a) Knowledge and data engineering aspects of knowledge based and expert systems, (b) Artificial Intelligence techniques relating to knowledge and data management, (c) Knowledge and data engineering tools and techniques, (d) Distributed knowledge base and database processing, (e) Real-time knowledge bases and databases, (f) Architectures for knowledge and data based systems, (g) Data management methodologies, (h) Database design and modeling, (i) Query, design, and implementation languages, (j) Integrity, security, and fault tolerance, (k) Distributed database control, (l) Statistical databases, (m) System integration and modeling of these systems, (n) Algorithms for these systems, (o) Performance evaluation of these algorithms, (p) Data communications aspects of these systems, and (q) Applications of these systems.", "name": "Knowledge and Data Engineering, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "1.189", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=69", "eigen": "0.01769"}, {"impact": "0.502", "info": "The IEEE Region 9 has released the IEEE Latin America Transactions to enable the publication of non-published and technically excellent papers from Latin American engineers, in Spanish or Portuguese languages. Engineers and researchers from Portugal and Spain (and others countries with the same language) are also very welcome to submit their proposals.\n\r\nThe Transactions will be distributed through the Internet, thus, it will not be edited as conventional printed material. Technical papers awarded in Latin American Conferences can be included in the Transactions.", "name": "Latin America Transactions, IEEE", "subjectList": ["Aerospace", "Bioengineering", "Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Engineered Materials, Dielectrics & Plasmas", "Engineering Profession", "Fields, Waves & Electromagnetics", "General Topics for Engineers", "Geoscience", "Nuclear Engineering", "Photonics & Electro-Optics", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis", "Transportation"], "influence": "0.063", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9907", "eigen": "0.00153"}, {"impact": "1.869", "info": "The IEEE Transactions on Learning Technologies covers all advances in learning technologies and their applications, including but not limited to the following topics: innovative online learning systems; intelligent tutors; educational games; simulation systems for education and training; collaborative learning tools; learning with mobile devices; wearable devices and interfaces for learning; personalized and adaptive learning systems; tools for formative and summative assessment; tools for learning analytics and educational data mining; ontologies for learning systems; standards and web services that support learning; authoring tools for learning materials; computer support for peer tutoring; learning via computer-mediated inquiry, field, and lab work; social learning techniques; social networks and infrastructures for learning and knowledge sharing; and creation and management of learning objects.", "name": "Learning Technologies, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "0.548", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4620076", "eigen": "0.00114"}, {"impact": "3.652", "info": "The Journal of Lightwave Technology is comprised of original contributions, both regular papers and letters, covering work in all aspects of optical guided-wave science, technology, and engineering. Manuscripts are solicited which report original theoretical and/or experimental results which advance the technological base of guided-wave technology. Tutorial and review papers are by invitation only. Topics of interest include the following: fiber and cable technologies, active and passive guided-wave componentry (light sources, detectors, repeaters, switches, fiber sensors, etc.); integrated optics and optoelectronics; and systems, subsystems, new applications and unique field trials. System oriented manuscripts should be concerned with systems which perform a function not previously available, out-perform previously established systems, or represent enhancements in the state of the art in general.", "name": "Lightwave Technology, IEEE/OSA Journal of", "subjectList": ["Communication, Networking & Broadcasting", "Photonics & Electro-Optics"], "influence": "0.755", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=50", "eigen": "0.03006"}, {"impact": 0, "info": "", "name": "Magnetics Letters, IEEE", "subjectList": [], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/tocresult.jsp?reload=true&isnumber=5257438", "eigen": 0}, {"impact": "1.467", "info": "Science and technology related to the basic physics and engineering of magnetism, magnetic materials, applied magnetics, magnetic devices, and magnetic data storage. The IEEE Transactions on Magnetics  publishes scholarly articles of archival value as well as tutorial expositions and critical reviews of classical subjects and topics of current interest.", "name": "Magnetics, IEEE Transactions on", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "0.365", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=20", "eigen": "0.02737"}, {"impact": "3.936", "info": "Published jointly by the IEEE and ASME. It encompasses all practical aspects of the theory and methods of mechatronics, the synergetic integration of mechanical engineering with electronic and intelligent computer control in the design and manufacture of industrial products and processes. The ten technical areas included are: Modeling and Design, Manufacturing, Motion Control, System Integration, Vibration and Noise Control, Actuators and Sensors, Micro Devices and Opto-Electronics Systems, Intelligent Control, Automotive Systems, Robotics, and Other Applications.", "name": "Mechatronics, IEEE/ASME Transactions on", "subjectList": ["Power, Energy, & Industry Applications"], "influence": "1.093", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=3516", "eigen": "0.01643"}, {"impact": "6.131", "info": "IEEE Transactions on Medical Imaging (T-MI) encourages the submission of manuscripts on imaging of body structure, morphology and function, including cell and molecular imaging and all forms of microscopy. The journal publishes original contributions on medical imaging achieved by modalities including ultrasound, X-rays, magnetic resonance, radionuclides, microwaves, and optical methods. Contributions describing novel acquisition techniques, medical image processing and analysis, visualization and performance, pattern recognition, machine learning, and related methods are encouraged. Studies involving highly technical perspectives are most welcome.", "name": "Medical Imaging, IEEE Transactions on", "subjectList": ["Bioengineering", "Computing & Processing"], "influence": "1.733", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=42", "eigen": "0.0242"}, {"impact": "1.913", "info": "\r\n\tIEEE Micro addresses users and designers of microprocessors and microprocessor systems, including managers, engineers, consultants, educators, and students involved with computers and peripherals, components and subassemblies, communications, instrumentation and control equipment, and guidance systems. Contributions should relate to the design, performance, or application of microprocessors and microcomputers. Tutorials, review papers, and discussions are also welcome. Sample topic areas include architecture, communications, data acquisition, control, hardware and software design/implementation, algorithms (including program listings), digital signal processing, microprocessor support hardware, operating systems, computer aided design, languages, application software, and development systems.", "name": "Micro, IEEE", "subjectList": ["Computing & Processing"], "influence": "0.898", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=40", "eigen": "0.00253"}, {"impact": "2.475", "info": "The topics of interest include, but are not limited to: devices ranging in size from microns to millimeters, IC-compatible fabrication techniques, other fabrication techniques, measurement of micro phenomena, theoretical results, new materials and designs, micro actuators, micro robots, micro batteries, bearings, wear, reliability, electrical interconnections, micro telemanipulation, and standards appropriate to MEMS. Application examples and application oriented devices in fluidics, optics, bio-medical engineering, etc., are also of central interest.", "name": "Microelectromechanical Systems, IEEE/ASME Journal of", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas"], "influence": "0.506", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=84", "eigen": "0.00597"}, {"impact": "2.169", "info": "The IEEE Microwave and Wireless Components Letters (MWCL) publishes three page papers that focus on microwave theory, techniques and applications as they relate to components, devices, circuits, biological effects, and systems involving the generation, modulation, demodulation, control, transmission, and detection of microwave signals. This includes scientific, technical, medical and industrial activities.  Microwave theory and techniques relates to electromagnetic waves in the frequency range of a few MHz and a THz; other spectral regions and wave types are included within the scope of the MWCL whenever basic microwave theory and techniques can yield useful results. Generally, this occurs in the theory of wave propagation in structures with dimensions comparable to a wavelength, and in the related techniques for analysis and design.", "name": "Microwave and Wireless Components Letters, IEEE", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "0.737", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7260", "eigen": "0.01356"}, {"impact": "2.962", "info": "IEEE Microwave Magazine includes the current newsletter contents, including the President's message, committee reports, and conference and meeting schedules and reports, of the IEEE Microwave Theory and Techniques Society. The magazine also publishes reviewed Tutorial and Application articles as well as book reviews and regular columns.", "name": "Microwave Magazine, IEEE", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "1.01", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6668", "eigen": "0.00467"}, {"impact": "3.176", "info": "The IEEE Transactions on Microwave Theory and Techniques focuses on that part of engineering and theory associated with microwave/millimeter-wave components, devices, circuits, and systems involving the generation, modulation, demodulation, control, transmission, and detection of microwave signals. This includes scientific, technical, and industrial, activities. Microwave theory and techniques relates to electromagnetic waves usually in the frequency region between a few MHz and a THz; other spectral regions and wave types are included within the scope of the Society whenever basic microwave theory and techniques can yield useful results. Generally, this occurs in the theory of wave propagation in structures with dimensions comparable to a wavelength, and in the related techniques for analysis and design.", "name": "Microwave Theory and Techniques, IEEE Transactions on", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "1.153", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=22", "eigen": "0.03341"}, {"impact": "4.098", "info": "IEEE Transactions on Mobile Computing focuses on the key technical issues related to (a) architectures, (b) support services, (c) algorithm/protocol design and analysis, (d) mobile environments, (e) mobile communication systems, (f) applications, and (g) emerging technologies. Topics of interest include, but are not limited to, the following: a) Architectures - Mobile networks and hosts, Agents and proxies, Mobility management, mobile agent and proxy architectures Integrated wireline and wireless systems, Planning and standardization. b) Support Services - Mobility and roaming, Nomadic computing, Multimedia Operating system support, Power management. c) Algorithm/Protocol Design and Analysis - Online and mobile environments, Limited bandwidth, Intermittent connectivity. d) Mobile Environments - Data and knowledge management, Performance modeling and characterization, Security, scalability and reliability, Design, management and operation, Systems and technologies. e) Mobile Communication Systems - Wireless, cellular and spread-spectrum systems, Multi-user and multi-access techniques and algorithms, Multi-channel processing, Channel coding, Data coding and compression. f) Applications - Location-dependent and sensitive, Nomadic computing, Wearable computers and body area networks, Multimedia applications and multimedia signal processing, Pervasive computing, Wireless sensor networks. g) Emerging Technologies.", "name": "Mobile Computing, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "1.237", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7755", "eigen": "0.01646"}, {"impact": "1.898", "info": "\nIEEE MultiMedia contains technical information covering a broad range of issues in multimedia systems and applications. Articles discuss research as well as advanced practice in hardware/software and are expected to span the range from theory to working systems. Especially encouraged are papers discussing experiences with new or advanced systems and subsystems. To avoid unnecessary overlap with existing publications, acceptable papers must have a significant focus on aspects unique to multimedia systems and applications. These aspects are likely to be related to the special needs of multimedia information compared to other electronic data, for example, the size requirements of digital media and the importance of time in the representation of such media. The following list is not exhaustive, but is representative of the topics that are covered: Hardware and software for media compression, coding & processing; Media representations & standards for storage, editing, interchange, transmission & presentation; Hardware platforms supporting multimedia applications; Operating systems suitable for multimedia applications; Storage devices & technologies for multimedia information; Network technologies, protocols, architectures & delivery techniques intended for multimedia; Synchronization issues; Multimedia databases; Formalisms for multimedia information systems & applications; Programming paradigms & languages for multimedia; Multimedia user interfaces; Media creation integration editing & management; Creation & modification of multimedia applications. The primary goal of the magazine is to provide a forum for researchers and practitioners to present new findings and discuss experiences with multimedia systems and applications. In addition, the magazine keeps readers informed of the state of the art in the multimedia arena, including technical trends and research directions.", "name": "MultiMedia, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "0.901", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=93", "eigen": "0.00188"}, {"impact": "3.977", "info": "The scope of the Periodical is the various aspects of research in multimedia technology and applications of multimedia, including, but not limited to, circuits, networking, signal processing, systems, software, and systems integration, as represented by the Fields of Interest of the sponsors. ", "name": "Multimedia, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems"], "influence": "1.392", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6046", "eigen": "0.0171"}, {"impact": "2.158", "info": "The IEEE Transactions on NanoBioscience reports on original, innovative and interdisciplinary work on all aspects of molecular systems, cellular systems, and tissues (including molecular electronics). Topics covered in the journal focus on a broad spectrum of aspects, both on foundations and on applications. Specifically, methods and techniques, experimental aspects, design and implementation, instrumentation and laboratory equipment, clinical aspects, hardware and software data acquisition and analysis and computer based modelling are covered (based on traditional or high performance computing - parallel computers or computer networks).\n\r\nIndexed in Pubmed® and Medline®, products of the United States National Laboratory of Medicine\n    ", "name": "NanoBioscience, IEEE Transactions on", "subjectList": ["Bioengineering", "Components, Circuits, Devices & Systems"], "influence": "0.624", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7728", "eigen": "0.00302"}, {"impact": "2.857", "info": "The IEEE Transactions on Nanotechnology is devoted to the publication of manuscripts of archival value in the general area of nanotechnology, which is rapidly emerging as one of the fastest growing and most promising new technological developments for the next generation and beyond.", "name": "Nanotechnology, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Computing & Processing"], "influence": "0.601", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7729", "eigen": "0.00633"}, {"impact": 0, "info": "IEEE Nanotechnology Magazine publishes peer-reviewed articles that present emerging trends and practices in industrial electronics product research and development, key insights, and tutorial surveys in the field of interest to the member societies of the IEEE Nanotechnology Council. IEEE Nanotechnology Magazine will be limited to the scope of the Nanotechnology Council, which supports the theory, design, and development of nanotechnology and its scientific, engineering, and industrial applications.", "name": "Nanotechnology Magazine, IEEE", "subjectList": ["Components, Circuits, Devices & Systems", "Computing & Processing"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4451717", "eigen": 0}, {"impact": "7.197", "info": "\r\n\tAs currently defined, IEEE Network covers the following areas: 1. network protocols and architectures, 2. Protocol design and validation, 3. Communication software and its development and test, 4. Network control and signalling, 5. network management, 6. Practical network implementations including local area networks, (LANs), metropolitan area networks (MANs), and wide area networks, (WANs), 7. Switching and processing in integrated (voice/data) networks and network components, 8. Micro-to-host communication.", "name": "Network, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "2.096", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=65", "eigen": "0.0091"}, {"impact": 0, "info": "The IEEE Transactions on Network Science and Engineering is committed to timely publishing of peer-reviewed technical articles that deal with the theory and applications of network science and the interconnections among the elements in a system that form a network.", "name": "Network Science and Engineering, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Signal Processing & Analysis"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488902", "eigen": 0}, {"impact": "3.286", "info": "IEEE Transactions on Network and Service Management will publish (online only) peerreviewed archival quality papers that advance the state-of-the-art and practical applications of network and service management. Theoretical research contributions (presenting new concepts and techniques) and applied contributions (reporting on experiences and experiments with actual systems) will be encouraged. These transactions will focus on the key technical issues related to: Management Models, Architectures and Frameworks; Service Provisioning, Reliability and Quality Assurance; Management Functions; Enabling Technologies; Information and Communication Models; Policies; Applications and Case Studies; Emerging Technologies and Standards.", "name": "Network and Service Management, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "1.061", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "eigen": "0.00267"}, {"impact": "3.11", "info": "The IEEE/ACM Transactions on Networking’s high-level objective is to publish high-quality, original research results derived from theoretical or experimental exploration of the area of communication/computer networking, covering all sorts of information transport networks over all sorts of physical layer technologies, both wireline (all kinds of guided media: e.g., copper, optical) and wireless (e.g., radio-frequency, acoustic (e.g., underwater), infra-red), or hybrids of these. The journal welcomes applied contributions reporting on novel experiences and experiments with actual systems.", "name": "Networking, IEEE/ACM Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "1.21", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "eigen": "0.01452"}, {"impact": "7.982", "info": "IEEE Transactions on Neural Networks and Learning Systems publishes technical articles that deal with the theory, design, and applications of neural networks and related learning systems. Emphasis will be given to artificial neural networks and learning systems.", "name": "Neural Networks and Learning Systems, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "General Topics for Engineers"], "influence": "2.454", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962385", "eigen": "0.03533"}, {"impact": "3.972", "info": "Rehabilitative and neural aspects of biomedical engineering, including functional electrical stimulation, acoustic dynamics, human performance measurement and analysis, nerve stimulation, electromyography, motor control and stimulation; and hardware and software applications for rehabilitation engineering and assistive devices. \n\r\nIndexed in Pubmed® and Medline®, products of the United States National Laboratory of Medicine\n    ", "name": "Neural Systems and Rehabilitation Engineering, IEEE Transactions on", "subjectList": ["Bioengineering", "Computing & Processing", "Robotics & Control Systems"], "influence": "1.068", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7333", "eigen": "0.00826"}, {"impact": "1.44", "info": "The IEEE Transactions on Nuclear Science is a publication of the IEEE Nuclear and Plasma Sciences Society.  It is viewed as the primary source of technical information in many of the areas it covers.  As judged by JCR impact factor, TNS consistently ranks in the top five journals in the category of Nuclear Science & Technology.  It has one of the higher immediacy indices, indicating that the information it publishes is viewed as timely, and has a relatively long citation half-life, indicating that the published information also is viewed as valuable for a number of years.", "name": "Nuclear Science, IEEE Transactions on", "subjectList": ["Bioengineering", "Nuclear Engineering"], "influence": "0.364", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=23", "eigen": "0.01174"}, {"impact": "2.065", "info": "The IEEE Journal of Oceanic Engineering (ISSN 0364-9059) is the online-only quarterly publication of the IEEE Oceanic Engineering Society (IEEE OES). The scope of the Journal is the field of interest of the IEEE OES, which encompasses all aspects of science, engineering, and technology that address research, development, and operations pertaining to all bodies of water. This includes the creation of new capabilities and technologies from concept design through prototypes, testing, and operational systems to sense, explore, understand, develop, use, and responsibly manage natural resources.", "name": "Oceanic Engineering, IEEE Journal of", "subjectList": ["Geoscience"], "influence": "0.658", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=48", "eigen": "0.00325"}, {"impact": "2.261", "info": "\r\n\tThe scope of the Journal includes advances in the state-of-the-art of optical networking science, technology, and engineering. Both theoretical contributions (including new techniques, concepts, analyses, and economic studies) and practical contributions (including optical networking experiments, prototypes, and new applications) are encouraged. Subareas of interest include the architecture and design of optical networks, optical network survivability and security, software-defined optical networking, elastic optical networks, data and control plane advances, network management related innovation, and optical access networks.  Enabling technologies and their applications are suitable topics only if the results are shown to directly impact optical networking beyond simple point-to-point networks.", "name": "Optical Communications and Networking, IEEE/OSA Journal of", "subjectList": ["Communication, Networking & Broadcasting", "Photonics & Electro-Optics"], "influence": "0.599", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4563700", "eigen": "0.00594"}, {"impact": "3.971", "info": "IEEE Transactions on Parallel and Distributed Systems (TPDS) is published monthly. It publishes a range of papers, comments on previously published papers, and survey articles that deal with the parallel and distributed systems research areas of current importance to our readers. Particular areas of interest include, but are not limited to:", "name": "Parallel and Distributed Systems, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "1.35", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=71", "eigen": "0.02415"}, {"impact": "9.455", "info": "The IEEE Transactions on Pattern Analysis and Machine Intelligence publishes articles on all traditional areas of computer vision and image understanding, all traditional areas of pattern analysis and recognition, and selected areas of machine intelligence, with a particular emphasis on machine learning for pattern analysis. Areas such as techniques for visual search, document and handwriting analysis, medical image analysis, video and image sequence analysis, content-based retrieval of image and video, face and gesture recognition and relevant specialized hardware and/or software architectures are also covered.", "name": "Pattern Analysis and Machine Intelligence, IEEE Transactions on", "subjectList": ["Bioengineering", "Computing & Processing"], "influence": "4.714", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=34", "eigen": "0.06412"}, {"impact": "3.022", "info": "\r\n\tIEEE Pervasive Computing explores the role of computing in the physical world–as characterized by visions such as the Internet of Things and Ubiquitous Computing. Designed for researchers, practitioners, and educators, this publication acts as a catalyst for realizing the ideas described by Mark Weiser in 1988. The essence of this vision is the creation of environments saturated with sensing, computing, and wireless communication that gracefully support the needs of individuals and society. Many key building blocks for this vision are now viable commercial technologies: wearable and handheld computers, wireless networking, location sensing, Internet of Things platforms, and so on. However, the vision continues to present deep challenges for experts in areas such as hardware design, sensor networks, mobile systems, human-computer interaction, industrial design, machine learning, data science, and societal issues including privacy and ethics. Through special issues, the magazine explores applications in areas such as assisted living, automotive systems, cognitive assistance, hardware innovations, ICT4D, manufacturing, retail, smart cities, and sustainability. In addition, the magazine accepts peer-reviewed papers of wide interest under a general call, and also features regular columns on hot topics and interviews with luminaries in the field.", "name": "Pervasive Computing, IEEE", "subjectList": ["Computing & Processing"], "influence": "0.682", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7756", "eigen": "0.00134"}, {"impact": "2.627", "info": "Breakthroughs in the generation of light and in its control and utilization have given rise to the field of Photonics, a rapidly expanding area of science and technology with major technological and economic impact. Photonics integrates quantum electronics and optics to accelerate progress in the generation of novel photon sources and in their utilization in emerging applications at the micro and nano scales spanning from the far-infrared/THz to the x-ray region of the electromagnetic spectrum. IEEE Photonics Journal is an online-only journal dedicated to the rapid disclosure of top-quality peer-reviewed research at the forefront of all areas of photonics. Contributions addressing issues ranging from fundamental understanding to emerging technologies and applications are within the scope of the Journal.  The Journal  includes topics in: Photon sources from far infrared to X-rays, Photonics materials and engineered photonic structures, Integrated optics and optoelectronic, Ultrafast, attosecond, high field and short wavelength photonics, Biophotonics, including DNA photonics, Nanophotonics, Magnetophotonics, Fundamentals of  light propagation and interaction; nonlinear effects, Optical data storage, Fiber optics and optical communications devices, systems, and technologies, Micro Opto Electro Mechanical Systems (MOEMS),  Microwave photonics, Optical Sensors.", "name": "Photonics Journal, IEEE", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Photonics & Electro-Optics"], "influence": "0.620", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4563994", "eigen": "0.01474"}, {"impact": "2.446", "info": "IEEE Photonics Technology Letters addresses all aspects of the IEEE Photonics Society Constitutional Field of Interest with emphasis on photonic/lightwave components and applications, laser physics and systems and laser/electro-optics technology. Examples of subject areas for the above areas of concentration are integrated optic and optoelectronic devices, high-power laser arrays (e.g. diode, CO2), free electron lasers, solid, state lasers, laser materials' interactions and femtosecond laser techniques. The letters journal publishes engineering, applied physics and physics oriented papers. Emphasis is on rapid publication of timely manuscripts. A goal is to provide a focal point of quality engineering-oriented papers in the electro-optics field not found in other rapid-publication journals.", "name": "Photonics Technology Letters, IEEE", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Photonics & Electro-Optics"], "influence": "0.527", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=68", "eigen": "0.02405"}, {"impact": "3.075", "info": "The IEEE Journal of Photovoltaics is a peer-reviewed, archival publication reporting original and significant research results that advance the field of photovoltaics (PV). The PV field is diverse in its science base ranging from semiconductor and PV device physics to optics and the materials sciences. The journal publishes articles that connect this science base to PV science and technology. The intent is to publish original research results that are of primary interest to the photovoltaic specialist.", "name": "Photovoltaics, IEEE Journal of", "subjectList": ["Photonics & Electro-Optics"], "influence": "0.933", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5503869", "eigen": "0.01331"}, {"impact": "1.253", "info": "The scope covers all aspects of the theory and application of plasma science. It includes the following areas: magnetohydrodynamics; thermionics and plasma diodes; basic plasma phenomena; gaseous electronics; microwave/plasma interaction; electron, ion, and plasma sources; space plasmas; intense electron and ion beams; laser-plasma interactions; plasma diagnostics; plasma chemistry and processing; solid-state plasmas; plasma heating; plasma for controlled fusion research; high energy density plasmas; industrial/commercial applications of plasma physics; plasma waves and instabilities; and high power microwave and submillimeter wave generation. ", "name": "Plasma Science, IEEE Transactions on", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics"], "influence": "0.297", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=27", "eigen": "0.01147"}, {"impact": 0, "info": "IEEE Potentials is the magazine dedicated to undergraduate and graduate students and young professionals. IEEE Potentials explores career strategies, the latest in research, and important technical developments. Through its articles, it also relates theories to practical applications, highlights technology's global impact and generates international forums that foster the sharing of diverse ideas about the profession.", "name": "Potentials, IEEE", "subjectList": [], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=45", "eigen": 0}, {"impact": "3.35", "info": "The scope of the IEEE Transactions on Power Delivery embraces innovations in electric apparatus for power delivery with a main focus on power transmission and distribution components. It also covers apparatus modeling, analysis, implementation and application issues such as power system protection, instrumentation, communication, and grounding; electromagnetic transients and power quality; and substation automation. The Transaction's scope further includes research works leading to power engineering standards.", "name": "Power Delivery, IEEE Transactions on", "subjectList": ["Power, Energy, & Industry Applications"], "influence": "1.086", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=61", "eigen": "0.02234"}, {"impact": "2.689", "info": "IEEE Power & Energy Magazine is dedicated to disseminating information on all matters of interest to electric power engineers and other professionals involved in the electric power industry with a focus on advanced concepts, technologies, and practices associated with all aspects of electric power from a technical perspective in synergy with nontechnical areas such as business, environmental, and social concerns. IEEE Power & Energy Magazine keeps its readers up-to-date on the latest technological advancements, industry news, business trends and strategies, products, and publications. Important newsworthy items concerning the worldwide activities and achievements of IEEE Power & Energy Society (PES), its organizational units, and its individual members are also included.", "name": "Power & Energy Magazine, IEEE", "subjectList": ["Power, Energy, & Industry Applications"], "influence": "1.039", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8014", "eigen": "0.003"}, {"impact": 0, "info": "IEEE Power Electronics magazine publishes peer-reviewed articles related to power electronics and its applications which encompass the effective use of electronic components, application of control theory and circuit design techniques, and the development of analytical tools used in efficient and effective energy conversion, control, utilization, and conditioning of electric power.", "name": "Power Electronics Magazine, IEEE", "subjectList": ["Components, Circuits, Devices & Systems", "Power, Energy, & Industry Applications"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6570649", "eigen": 0}, {"impact": "6.812", "info": "The IEEE Transactions on Power Electronics journal covers all issues of widespread or generic interest to engineers who work in the field of power electronics. The Journal editors will enforce standards and a review policy equivalent to the IEEE Transactions, and only papers of high technical quality will be accepted. Papers which treat new and novel device, circuit or system issues which are of generic interest to power electronics engineers are published. Papers which are not within the scope of this Journal will be forwarded to the appropriate IEEE Journal or Transactions editors. Examples of papers which would be more appropriately published in other Journals or Transactions include: 1) Papers describing semiconductor or electron device physics. These papers would be more appropriate for the IEEE Transactions on Electron Devices. 2) Papers describing applications in specific areas: e.g., industry, instrumentation, utility power systems, aerospace, industrial electronics, etc. These papers would be more appropriate for the Transactions of the Society which is concerned with these applications. 3) Papers describing magnetic materials and magnetic device physics. These papers would be more appropriate for the IEEE Transactions on Magnetics. 4) Papers on machine theory. These papers would be more appropriate for the IEEE Transactions on Power Systems.  While original papers of significant technical content will comprise the major portion of the Journal, tutorial papers and papers of historical value are also reviewed for publication. ", "name": "Power Electronics, IEEE Transactions on", "subjectList": ["Aerospace", "Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics", "General Topics for Engineers", "Nuclear Engineering", "Power, Energy, & Industry Applications", "Signal Processing & Analysis", "Transportation"], "influence": "1.645", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=63", "eigen": "0.06836"}, {"impact": "5.255", "info": "The scope of this Transactions covers the requirements, planning, analysis, reliability, operation, and economics of electric generating, transmission, and distribution systems for general industrial, commercial, public, and domestic consumption. The main focus of the IEEE Transactions on Power Systems is the power system from a systems viewpoint instead of components of the system. It has five (5) key areas within its scope with several subdivisions within each area. These areas are: (1) Power Engineering Education, (2) Power System Analysis, Computing, and Economics, (3) Power System Dynamic Performance, (4) Power System Operations, and (5) Power System Planning and Implementation. The purviews of these areas are broad and do not need frequent updates. However, if a new technology evolves in the industry and it needs specific focus, the purview of the corresponding area is updated to include the technology and the IEEE Transactions on Power Systems identifies it as a new subdivision. The current scope and the subdivisions under each area are shown below. Area 1 - Power Engineering Education: New instruction methods (software/internet/laboratory/combined with research), Virtual classrooms/laboratories, Distance education, Life-long learning. Area 2 - Power System Analysis, Computing, and Economics: Computational techniques and analytical methods for planning, operations and control, Computing applications, Distribution system analysis, Economics, market organization, cost structures, pricing and risk management, Intelligent system applications, Reliability, uncertainty and probability and stochastic system applications. Area 3 - Power System Dynamic Performance: Power system dynamic modeling: components and systems, Power system stability: phenomena, analysis, and techniques, Power system stability controls: design and applications, Power system dynamic measurements, Power system interaction with turbine generators, Dynamic security assessment: techniques and applications, risk-based methods. Area 4 - Power System Operations: Emerging methods for restructured systems, Transmission operations and security, Energy control centers, Distribution operation, System control, Operating economics and pricing.  Area 5 - Power System Planning & Implementation: Generation system resource planning, Transmission system planning, Distribution system planning, Integrated resource planning and distributed resource planning, Load forecasting, Customer products and services planning and implementation. Industry restructuring planning and policy issue.", "name": "Power Systems, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Power, Energy, & Industry Applications"], "influence": "1.756", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=59", "eigen": "0.0482"}, {"impact": "9.107", "info": "Proceedings of the IEEE is the leading journal to provide in-depth review, survey, and tutorial coverage of the technical developments in electronics, electrical and computer engineering, and computer science. Consistently ranked as one of the top journals by Impact Factor, Article Influence Score and more, the journal serves as a trusted resource for engineers around the world.", "name": "Proceedings of the IEEE", "subjectList": ["Engineering Profession", "General Topics for Engineers"], "influence": "3.278", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5", "eigen": "0.03139"}, {"impact": "0.756", "info": "The IEEE Transactions on Professional Communication is a peer-reviewed journal devoted to applied research on professional communication—including but not limited to technical and business communication. Papers should address the research interests and needs of technical communicators, engineers, scientists, information designers, editors, linguists, translators, managers, business professionals, and others from around the globe who practice, conduct research on, and teach others about effective professional communication.\n\r\nThe Transactions publishes original, empirical research that addresses one of these contexts:", "name": "Professional Communication, IEEE Transactions on", "subjectList": ["Engineering Profession", "General Topics for Engineers"], "influence": "0.33", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=47", "eigen": "0.00047"}, {"impact": "0.587", "info": "IEEE Pulse covers both general and technical articles on current technologies and methods used in biomedical and clinical engineering; societal implications of medical technologies; current news items; book reviews; patent descriptions; and correspondence. Special interest departments, students, law, clinical engineering, ethics, new products, society news, historical features and government.\n\r\nIndexed in Pubmed® and Medline®, products of the United States National Laboratory of Medicine\n    ", "name": "Pulse, IEEE", "subjectList": ["Bioengineering"], "influence": "0.175", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5454060", "eigen": "0.00061"}, {"impact": "2.069", "info": "The IEEE Journal of Quantum Electronics is dedicated to the publication of manuscripts reporting novel experimental or theoretical results in the broad field of the science and technology of quantum electronics. The Journal comprises original contributions, both regular papers and letters, describing significant advances in the understanding of quantum electronics phenomena or the demonstration of new devices, systems, or applications. Manuscripts reporting new developments in systems and applications must emphasize quantum electronics principles or devices. The scope of JQE encompasses the generation, propagation, detection, and application of coherent electromagnetic radiation having wavelengths below one millimeter (i.e., in the submillimeter, infrared, visible, ultraviolet, etc., regions). Whether the focus of a manuscript is a quantum-electronic device or phenomenon, the critical factor in the editorial review of a manuscript is the potential impact of the results presented on continuing research in the field or on advancing the technological base of quantum electronics.", "name": "Quantum Electronics, IEEE Journal of", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Photonics & Electro-Optics"], "influence": "0.469", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=3", "eigen": "0.00433"}, {"impact": "2.729", "info": "IEEE Transactions on Reliability is a refereed journal for the reliability and allied disciplines including, but not limited to, maintainability, physics of failure, life testing, prognostics, design and manufacture for reliability, reliability for systems of systems, network availability, mission success, warranty, safety, and various measures of effectiveness. Topics eligible for publication range from hardware to software, from materials to systems, from consumer and industrial devices to manufacturing plants, from individual items to networks, from techniques for making things better to ways of predicting and measuring behavior in the field. As an engineering subject that supports new and existing technologies, we constantly expand into new areas of the assurance sciences.", "name": "Reliability, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "0.992", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=24", "eigen": "0.00707"}, {"impact": "4.264", "info": "The IEEE Transactions on Robotics (T-RO) publishes fundamental papers on all aspects of Robotics, featuring interdisciplinary approaches from computer science, control systems, electrical engineering, mathematics, mechanical engineering, and other fields. Robots and intelligent machines and systems are critical in areas such as industrial applications; service and personal assistants; surgical operations; space, underwater, and remote exploration; entertainment; safety, search, and rescue; military applications; agriculture applications; and intelligent vehicles. Special emphasis in the T-RO is placed on intelligent machines and systems for unstructured environments, where a significant portion of the environment is unknown and cannot be directly sensed or controlled.", "name": "Robotics, IEEE Transactions on", "subjectList": ["Robotics & Control Systems"], "influence": "1.448", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8860", "eigen": "0.01225"}, {"impact": "3.573", "info": "IEEE Robotics & Automation Magazine is a unique technology publication which is peer-reviewed, readable and substantive.  The Magazine is a forum for articles which fall between the academic and theoretical orientation of scholarly journals and vendor sponsored trade publications.  IEEE Transactions on Robotics and IEEE Transactions on Automation Science and Engineering publish advances in theory and experiment that underpin the science of robotics and automation.  The Magazine complements these publications and seeks to present new scientific results to the practicing engineer through a focus on working systems and emphasizing creative solutions to real-world problems and highlighting implementation details. The Magazine publishes regular technical articles that undergo a peer review process overseen by the Magazine's associate editors; special issues on important and emerging topics in which all articles are fully reviewed but managed by guest editors; tutorial articles written by leading experts in their field; and regular columns on topics including education, industry news, IEEE RAS news, technical and regional activity and a calendar of events.", "name": "Robotics & Automation Magazine, IEEE", "subjectList": ["Aerospace", "Components, Circuits, Devices & Systems", "Computing & Processing", "Engineering Profession", "General Topics for Engineers", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis", "Transportation"], "influence": "1.719", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=100", "eigen": "0.00454"}, {"impact": "7.172", "info": "Each issue of the IEEE Journal on Selected Areas in Communications (JSAC) is devoted to a specific technical topic and thus provides to JSAC readers a collection of up-to-date papers on that topic. These issues are valuable to the research community and become valuable references. The technical topics covered by JSAC issues span the entire field of communications and networking. JSAC publishes only papers that are submitted in response to a Call-for-Papers. These calls are published in JSAC issues and other publications of the IEEE Communications Society as appropriate to the subject area of the call. Papers submitted for review for possible publication in a JSAC issue must be submitted to one of the Guest Editors listed in the Call-for-Papers. See \"Information for Authors\" found in any JSAC issue for additional instructions. Topics for JSAC issues are determined by the JSAC Editorial Board after review of proposals submitted by interested parties. All are invited to submit proposals. Instructions for submitting proposals are included in the Guidelines for Proposal preparation on the JSAC website. Recent issue themes included: Network Coding for Wireless Communication Networks, Wireless and Pervasive Communications for Healthcare, Network Infrastructure Configuration, Broadband Access Networks: Architectures and Protocols, Body Area Networking: Technology and Applications, Underwater Wireless Communication Networks, Game Theory in Communication Systems, Exploiting Limited Feedback in Tomorrow’s Communication Networks.", "name": "Selected Areas in Communications, IEEE Journal on", "subjectList": ["Communication, Networking & Broadcasting"], "influence": "2.716", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=49", "eigen": "0.04435"}, {"impact": "1.239", "info": "", "name": "Security and Privacy Magazine, IEEE", "subjectList": [], "influence": "0.456", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8013", "eigen": "0.00185"}, {"impact": "2.777", "info": "The IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing addresses the growing field of applications in Earth observations and remote sensing, and also provides a venue for the rapidly expanding special issues that are being sponsored by the IEEE Geosciences and Remote Sensing Society. The journal draws upon the experience of the highly successful “IEEE Transactions on Geoscience and Remote Sensing” and provide a complementary medium for the wide range of topics in applied earth observations. The ‘Applications’ areas encompasses the societal benefit areas of the Global Earth Observations Systems of Systems (GEOSS) program. Through deliberations over two years, ministers from 50 countries agreed to identify nine areas where Earth observation could positively impact the quality of life and health of their respective countries. Some of these are areas not traditionally addressed in the IEEE context. These include biodiversity, health and climate. Yet it is the skill sets of IEEE members, in areas such as observations, communications, computers, signal processing, standards and ocean engineering, that form the technical underpinnings of GEOSS. Thus, the Journal attracts a broad range of interests that serves both present members in new ways and expands the IEEE visibility into new areas. ", "name": "Selected Topics in Applied Earth Observations and Remote Sensing, IEEE Journal of", "subjectList": ["Geoscience", "Signal Processing & Analysis"], "influence": "0.838", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443", "eigen": "0.02125"}, {"impact": "4.361", "info": "The scope of the IEEE Journal of Selected Topics in Signal Processing (JSTSP) is the Field of Interest of the IEEE Signal Processing Society: “The theory and application of filtering, coding, transmitting, estimating, detecting, analyzing, recognizing, synthesizing, recording, and reproducing signals by digital or analog devices or techniques. The term “signal” includes audio, video, speech, image, communication, geophysical, sonar, radar, medical, musical, and other signals.”  The format of the journal allows the exploration, in depth, of a signal processing topic by providing a tutorial article supported by several briefer articles in the topical area that provides the broadest possible examination of the topic considering the submissions. This format allows the Society to not only provide review issues on more mature signal processing topical areas, but also to explore new areas, particularly those at the nexus of other engineering disciplines that are dependent upon signal processing (e.g., biomedical engineering; language), as well as those not traditionally part of the engineering landscape (e.g., genetics; security; atmospheric prediction). ", "name": "Selected Topics in Signal Processing, IEEE Journal of", "subjectList": ["Signal Processing & Analysis"], "influence": "2.406", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4200690", "eigen": "0.01661"}, {"impact": "3.367", "info": "Papers published in the IEEE Journal of Selected Topics in Quantum Electronics fall within the broad field of science and technology of quantum electronics of a device, subsystem, or system-oriented nature. Each issue is devoted to a specific topic within this broad spectrum. Announcements of the topical areas planned for future issues, along with deadlines for receipt of manuscripts, are published in this Journal and in the IEEE Journal of Quantum Electronics. Generally, the scope of manuscripts appropriate to this Journal is the same as that for the IEEE Journal of Quantum Electronics. Manuscripts are published that report original theoretical and/or experimental research results that advance the scientific and technological base of quantum electronics devices, systems, or applications. The Journal is dedicated toward publishing research results that advance the state of the art or add to the understanding of the generation, amplification, modulation, detection, waveguiding, or propagation characteristics of coherent electromagnetic radiation having sub-millimeter and shorter wavelengths. In order to be suitable for publication in this Journal, the content of manuscripts concerned with subject-related research must have a potential impact on advancing the technological base of quantum electronic devices, systems, and/or applications. Potential authors of subject-related research have the responsibility of pointing out this potential impact. System-oriented manuscripts must be concerned with systems that perform a function previously unavailable or that outperform previously established systems that did not use quantum electronic components or concepts. Tutorial and review papers are by invitation only.", "name": "Selected Topics in Quantum Electronics, IEEE Journal of", "subjectList": ["Engineered Materials, Dielectrics & Plasmas", "Photonics & Electro-Optics"], "influence": "0.933", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=2944", "eigen": "0.014"}, {"impact": "1.336", "info": "The IEEE Transactions on Semiconductor Manufacturing addresses the challenging problems of manufacturing complex microelectronic components, especially very large scale integrated circuits (VLSI). Manufacturing these products requires precision micropatterning, precise control of materials properties, ultraclean work environments, and complex interactions of chemical, physical, electrical and mechanical processes. ", "name": "Semiconductor Manufacturing, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas"], "influence": "0.301", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=66", "eigen": "0.00135"}, {"impact": "2.617", "info": "According to the IEEE Sensors Council's constitution, \"The fields of interest of the Council and its activities shall be the theory, design, fabrication, manufacturing and application of devices for sensing and transducing physical, chemical, and biological phenomena, with emphasis on the electronics and physics aspects of sensors and integrated sensor-actuators.\" The IEEE Sensors Journal focuses on the numerous sensor technologies spanned by the IEEE, and on emerging sensor technologies.", "name": "Sensors Journal, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Signal Processing & Analysis"], "influence": "0.564", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7361", "eigen": "0.0274"}, {"impact": "4.418", "info": "IEEE Transactions on Services Computing emphasizes the algorithmic, mathematical, statistical and computational methods that are central in services computing; the emerging field of Service Oriented Architecture, Web Services, Business Process Integration, Solution Performance Management, Services Operations and Management. ", "name": "Services Computing, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "1.331", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4629386", "eigen": "0.00517"}, {"impact": "2.813", "info": "The IEEE Signal Processing Letters is a monthly, archival publication designed to provide rapid dissemination of original, cutting-edge ideas and timely, significant contributions in signal, image, speech, language and audio processing.", "name": "Signal Processing Letters, IEEE", "subjectList": ["Signal Processing & Analysis"], "influence": "1.098", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=97", "eigen": "0.02529"}, {"impact": "4.203", "info": "The IEEE Transactions on Signal Processing covers novel theory, algorithms, performance analyses and applications of techniques for the processing, understanding, learning, retrieval, mining, and extraction of information from signals. The term \"signal\" includes, among others, audio, video, speech, image, communication, geophysical, sonar, radar, medical and musical signals. Examples of topics of interest include, but are not limited to, information processing and the theory and application of filtering, coding, transmitting, estimating, detecting, analyzing, recognizing, synthesizing, recording, and reproducing signals.", "name": "Signal Processing, IEEE Transactions on", "subjectList": ["Signal Processing & Analysis"], "influence": "1.558", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=78", "eigen": "0.05557"}, {"impact": "7.451", "info": "IEEE Signal Processing Magazine publishes tutorial-style articles on signal processing research and applications, as well as columns and forums on issues of interest. Its coverage ranges from fundamental principles to practical implementation, reflecting the multidimensional facets of interests and concerns of the community. Its mission is to bring up-to-date, emerging and active technical developments, issues, and events to the research, educational, and professional communities. It is also the main society communication platform addressing important issues concerning all members.", "name": "Signal Processing Magazine, IEEE", "subjectList": ["Signal Processing & Analysis"], "influence": "4.539", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=79", "eigen": "0.02001"}, {"impact": "7.364", "info": "The IEEE Transactions on Smart Grid is a cross disciplinary and internationally archival journal aimed at disseminating results of research on smart grid that relates to, arises from, or deliberately influences energy generation, transmission, distribution and delivery. The journal publishes original research on theories and development on principles of smart grid technologies and systems. The Transactions also welcomes manuscripts on design, implementation and evaluation of power systems that are affected by smart grid. Surveys of existing work on smart grid may also be considered for publication when they propose a new viewpoint on history and a challenging perspective on the future of smart grid.", "name": "Smart Grid, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing", "Power, Energy, & Industry Applications"], "influence": "2.303", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5165411", "eigen": "0.04341"}, {"impact": "3.331", "info": "The IEEE Transactions on Software Engineering is an archival journal published monthly. We are interested in well-defined theoretical results and empirical studies that have potential impact on the construction, analysis, or management of software. The scope of this Transactions ranges from the mechanisms through the development of principles to the application of those principles to specific environments. Since the journal is archival, it is assumed that the ideas presented are important, have been well analyzed, and/or empirically validated and are of value to the software engineering research or practitioner community. Specific topic areas include: a) development and maintenance methods and models, e.g., techniques and principles for the specification, design, and implementation of software systems, including notations and process models; b) assessment methods, e.g., software tests and validation, reliability models, test and diagnosis procedures, software redundancy and design for error control, and the measurements and evaluation of various aspects of the process and product; c) software project management, e.g., productivity factors, cost models, schedule and organizational issues, standards; d) tools and environments, e.g., specific tools, integrated tool environments including the associated architectures, databases, and parallel and distributed processing issues; e) system issues, e.g., hardware-software trade-off; and f) state-of-the-art surveys that provide a synthesis and comprehensive review of the historical development of one particular area of interest.", "name": "Software Engineering, IEEE Transactions on", "subjectList": ["Computing & Processing"], "influence": "1.012", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=32", "eigen": "0.00502"}, {"impact": "4.075", "info": "The IEEE Journal of Solid-State Circuits publishes papers each month in the broad area of solid-state circuits with particular emphasis on transistor-level design of integrated circuits. It also provides coverage of topics such as circuits modeling, technology, systems design, layout, and testing that relate directly to IC design. Integrated circuits and VLSI are of principal interest; material related to discrete circuit design is seldom published. Experimental verification is strongly encouraged.", "name": "Solid-State Circuits, IEEE Journal of", "subjectList": ["Components, Circuits, Devices & Systems", "Engineered Materials, Dielectrics & Plasmas"], "influence": "1.419", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4", "eigen": "0.02523"}, {"impact": 0, "info": "Each issue of IEEE Solid-State Circuits Magazine is a self-contained resource for fundamental theories and practical advances within the field of Integrated Circuits (ICs). Written at a tutorial level and often in a narrative style, the Magazine features articles by leaders from industry, academia and government explaining historical milestones, current trends and future developments. As a reflection of the Society’s field of interest, the Magazine covers all aspects of solid-state circuits: the design, testing and application of circuits and subsystems, as well as closely related topics in device technology and circuit theory, focus[ing] on scientific, technical and industrial applications, in addition to other activities that contribute to the field, or utilize the techniques or products of the field, as the art develops.", "name": "Solid-State Circuits Magazine, IEEE", "subjectList": ["Aerospace", "Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "Engineered Materials, Dielectrics & Plasmas", "Fields, Waves & Electromagnetics", "Geoscience", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis", "Transportation"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4563670", "eigen": 0}, {"impact": "2.879", "info": "\r\n\tIEEE Software delivers reliable, useful, leading-edge software development information to keep engineers and managers abreast of rapid technology change. Its mission is to build the community of leading software practitioners. The authority on translating software theory into practice, this magazine positions itself between pure research and pure practice, transferring ideas, methods, and experiences among researchers and engineers. Peerreviewed articles and columns by seasoned practitioners illuminate all aspects of the industry, including process improvement, project management, development tools, software maintenance, Web applications and opportunities, testing, and usability. The magazine's readers specify, design, document, test, maintain, purchase, engineer, sell, teach, research, and manage the production of software or systems that include software. IEEE Software welcomes articles describing how software is developed in specific companies, laboratories, and university environments as well as articles describing new tools, current trends, and past projects' limitations and failures as well as successes. Sample topics include geographically distributed development; software architectures; program and system debugging and testing; the education of software professionals; requirements, design, development, testing, and management methodologies; performance measurement and evaluation; standards; program and system reliability, security, and verification; programming environments; languages and language-related issues; Web-based development; usability; and software-related social and legal issues.", "name": "Software Magazine, IEEE", "subjectList": ["Computing & Processing"], "influence": "0.656", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=52", "eigen": "0.00278"}, {"impact": "2.105", "info": "\nIEEE Spectrum Magazine, the flagship publication of the IEEE, explores the development, applications and implications of new technologies. It anticipates trends in engineering, science, and technology, and provides a forum for understanding, discussion and leadership in these areas.\nIEEE Spectrum is the world's leading engineering and scientific magazine. Read by over 300,000 engineers worldwide, Spectrum provides international coverage of all technical issues and advances in computers, communications, and electronics. Written in clear, concise language for the non-specialist, Spectrum's high editorial standards and worldwide resources ensure technical accuracy and state-of-the-art relevance.", "name": "Spectrum, IEEE", "subjectList": ["Engineering Profession", "General Topics for Engineers"], "influence": "0.531", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6", "eigen": "0.003"}, {"impact": "6.235", "info": "The IEEE Transactions on Sustainable Energy is a cross disciplinary and internationally archival journal aimed at disseminating results of research on sustainable energy that relates to, arises from, or deliberately influences energy generation, transmission, distribution and delivery. The journal publishes original research on theories and development on principles of sustainable energy technologies and systems. The Transactions also welcomes manuscripts on design, implementation and evaluation of power systems that are affected by sustainable energy. Surveys of existing work on sustainable energy may also be considered for publication when they propose a new viewpoint on history and a challenging perspective on the future of sustainable energy.", "name": "Sustainable Energy, IEEE Transactions on", "subjectList": ["Power, Energy, & Industry Applications"], "influence": "1.922", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5165391", "eigen": "0.01859"}, {"impact": 0, "info": "\nJournal of Systems Engineering and Electronics, keeping abreast with the development trend of science and technology worldwide, reports the latest developments and achievements in both theoretical and practical aspects of systems engineering, electronics and related research areas. The journal welcomes high quality original papers from a wide range of countries.", "name": "Systems Engineering and Electronics, Journal of", "subjectList": ["Aerospace"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5971804", "eigen": 0}, {"impact": "4.337", "info": "This publication provides a systems-level, focused forum for application-oriented manuscripts that address complex systems and system-of-systems of national and global significance. It intends to encourage and facilitate cooperation and interaction among IEEE Societies with systems-level and systems engineering interest, and to attract non-IEEE contributors and readers from around the globe. Our IEEE Systems Council job is to address issues in new ways that are not solvable in the domains of the existing IEEE or other societies or global organizations. These problems do not fit within traditional hierarchical boundaries. For example, disaster response such as that triggered by Hurricane Katrina, tsunamis, or current volcanic eruptions is not solvable by pure engineering solutions. We need to think about changing and enlarging the paradigm to include systems issues.", "name": "Systems Journal, IEEE", "subjectList": ["Components, Circuits, Devices & Systems"], "influence": "1.047", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4267003", "eigen": "0.00786"}, {"impact": "5.131", "info": "\r\n\tThe scope of the IEEE Transactions on Systems, Man, and Cybernetics: Systems includes the fields of systems engineering. It includes issue formulation, analysis and modeling, decision making, and issue interpretation for any of the systems engineering lifecycle phases associated with the definition, development, and deployment of large systems. In addition, it includes systems management, systems engineering processes, and a variety of systems engineering methods such as optimization, modeling and simulation.", "name": "Systems, Man, amd Cybernetics: Systems, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "General Topics for Engineers", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": "1.073", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221021", "eigen": "0.00958"}, {"impact": 0, "info": "\r\n\tThe fields of systems engineering and human machine systems: systems engineering includes efforts that involve issue formulation, issue analysis and modeling, and decision making and issue interpretation at any of the lifecycle phases associated with the definition, development, and implementation of large systems. It also includes efforts that relate to systems management, systems engineering processes, and a variety of systems engineering methods such as optimization, decision making, modeling, and simulation. Human machine systems includes cognitive ergonomics, system test and evaluation, and human information processing concerns in systems and organizations.", "name": "Systems, Man and Cybernetics, Part A: Systems and Humans, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "General Topics for Engineers", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=3468", "eigen": 0}, {"impact": "6.22", "info": "\nIEEE Transactions on Systems, Man, and Cybernetics, Part B: Cybernetics focuses on cybernetics, including communication and control across humans, machines and organizations at the structural or neural level, as well as at functional and purposeful levels; design and development of biologically and linguistically motivated computational paradigms emphasizing vision, neural networks, genetic algorithms, fuzzy systems, automated planning, computational intelligence, and robotics.\n\r\n\tIndexed in Pubmed® and Medline®, products of the United States National Laboratory of Medicine\n    ", "name": "Systems, Man and Cybernetics, Part B: Cybernetics, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "General Topics for Engineers", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": "2.154", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=3477", "eigen": "0.0183"}, {"impact": "2.171", "info": "\r\n\tOverview, tutorial and application papers concerning all areas of interest to the SMC Society: systems engineering, human factors and human machine systems, and cybernetics and computational intelligence. Promotes newly established areas of multi-agent systems, semantics and ontologies.", "name": "Systems, Man and Cybernetics, Part C: Applications and Reviews, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "General Topics for Engineers", "Power, Energy, & Industry Applications", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": "1.083", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5326", "eigen": "0.00591"}, {"impact": "1.019", "info": "The following topics describe the scope of SSIT and of Technology and Society Magazine: Health and safety implications of technology Engineering ethics and professional responsibility Engineering education in social implications of technology History of electrotechnology Technical expertise and public policy Social issues related to energy Social issues related to information technology Social issues related to telecommunications Systems analysis in public policy decisions Economic issues related to technology Peace technology Environmental implications of technology Beyond these specific topics, Technology and Society Magazine is concerned with the broad area of the social implications of technology, especially electrotechnology. In a general sense the scope of IEEE Technology and Society Magazine overlaps most IEEE Publications since we are concerned with the social implications of technology across the wide range of IEEE fields of interests. Other IEEE publications that are most likely to include specific content that overlaps with ours include Spectrum, Today's Engineer, Computer, Annals of the History of Computing, Communications Magazine, Engineering in Medicine and Biology Magazine, Transactions on Professional Communication, Transactions on Education, and Engineering Management Review.", "name": "Technology and Society Magazine, IEEE", "subjectList": ["Engineering Profession", "General Topics for Engineers", "Signal Processing & Analysis"], "influence": "0.224", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=44", "eigen": "0.0004"}, {"impact": "2.955", "info": "IEEE Transactions on Terahertz Science and Technology focuses on original research on Terahertz theory, techniques, and applications as they relate to components, devices, circuits, and systems involving the generation, transmission, and detection of Terahertz waves. \r\n ", "name": "Terahertz Science and Technology, IEEE Transactions on", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "0.974", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5503871", "eigen": "0.00654"}, {"impact": "1.754", "info": "IEEE Journal of Translational Engineering in Health and Medicine will be a fully open access product that bridges the engineering and clinical worlds, focusing on detailed descriptions of advanced technical solutions to a clinical need along with clinical results and healthcare relevance. The journal is aimed at providing a platform for state-of-the-art technology directions in the interdisciplinary field of biomedical engineering, embracing engineering, life sciences and medicine. A unique aspect of the journal is its ability to foster collaboration between physicians and engineers for presenting broad and compelling real world technological and engineering solutions that can be implemented in the interest of improving quality of patient care and treatment outcomes, thereby reducing costs and improving efficiency. The journal provides an active forum for clinical research and relevant state-of the-art technology for members of all the IEEE societies that have an interest in biomedical engineering as well as reaching out directly to physicians and the medical community through the American Medical Association (AMA) and other clinical societies. The scope of the journal would include, but not be limited, to topics on: Medical devices, healthcare delivery systems, global healthcare initiatives, and ICT based services; Technological relevance to healthcare cost reduction; Technology affecting healthcare management, decision-making, and policy; Advanced technical work that is applied to solving specific clinical needs.", "name": "Translational Engineering in Health and Medicine, IEEE Journal of", "subjectList": ["Bioengineering", "Communication, Networking & Broadcasting", "Components, Circuits, Devices & Systems", "Computing & Processing", "General Topics for Engineers", "Robotics & Control Systems", "Signal Processing & Analysis"], "influence": "0.841", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221039", "eigen": "0.00066"}, {"impact": "2.704", "info": "IEEE Transactions on Ultrasonics, Ferroelectrics and Frequency Control  includes the theory, technology, materials, and applications relating to: (1) the generation, transmission, and detection of ultrasonic waves and related phenomena; (2) medical ultrasound, including hyperthermia, bioeffects, tissue characterization and imaging; (3) ferroelectric, piezoelectric, and piezomagnetic materials, including crystals, polycrystalline solids, films, polymers, and composites; (4) frequency control, timing and time distribution, including crystal oscillators and other means of classical frequency control, and atomic, molecular and laser frequency control standards. Areas of interest range from fundamental studies to the design and/or applications of devices and systems. ", "name": "Ultrasonics, Ferroelectrics and Frequency Control, IEEE Transactions on", "subjectList": ["Fields, Waves & Electromagnetics"], "influence": "0.605", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=58", "eigen": "0.00985"}, {"impact": "4.432", "info": "The IEEE Transactions on Vehicular Technology is dedicated to the publication of peer-reviewed original contributions of research regarding the theory and practice of electrical and electronics technology in vehicles and vehicular systems. The intended audience is comprised of engineers, researchers, educators, and graduate students of vehicular technology concepts and theory in academia, industry, and government. The scope of the Transactions is threefold (which was approved by the IEEE Periodicals Committee in 1967) and is published on the journal website as follows: Communications: The use of mobile radio on land, sea, and air, including cellular radio, two-way radio, and one-way radio, with applications to dispatch and control vehicles, mobile radiotelephone, radio paging, and status monitoring and reporting. Related areas include spectrum usage, component radio equipment such as cavities and antennas, compute control for radio systems, digital modulation and transmission techniques, mobile radio circuit design, radio propagation for vehicular communications, effects of ignition noise and radio frequency interference, and consideration of the vehicle as part of the radio operating environment. Transportation Systems: The use of electronic technology for the control of ground transportation systems including, but not limited to, traffic aid systems; traffic control systems; automatic vehicle identification, location, and monitoring systems; automated transport systems, with single and multiple vehicle control; and moving walkways or people-movers. Vehicular Electronics: The use of electronic or electrical components and systems for control, propulsion, or auxiliary functions, including but not limited to, electronic controls for engineer, drive train, convenience, safety, and other vehicle systems; sensors, actuators, and microprocessors for onboard use; electronic fuel control systems; vehicle electrical components and systems collision avoidance systems; electromagnetic compatibility in the vehicle environment; and electric vehicles and controls. In order to achieve its purpose, the Transactions receives and processes original contributions, for potential publication, from researchers, educators and students in the areas of vehicular technologies. The contributions can be conceptual, theoretical, or experimental. Two types of manuscripts are considered for publication. The publication categories are: Papers presenting the results of on-going or completed research, novel applications or tutorial summaries of the state of the art in engineering and technology; Correspondence presenting short original contributions, commenting on papers previously published, posing critical implementation problems, discussing experiences using published results, and reporting on successful and unsuccessful applications of engineering and technology concepts and methodologies. The audience of the Transactions on Vehicular Technology is predominantly the scholarly community conducting research on various aspects of engineering and technology in academic institutions, industrial organizations, research centers and government agencies.", "name": "Vehicular Technology, IEEE Transactions on", "subjectList": ["Aerospace", "Transportation"], "influence": "1.116", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25", "eigen": "0.04101"}, {"impact": 0, "info": "", "name": "Vehicular Technology Magazine, IEEE", "subjectList": [], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/tocresult.jsp?isnumber=34840", "eigen": 0}, {"impact": "1.744", "info": "Design and realization of microelectronic systems using VLSI/ULSI technologies requires close collaboration among scientists and engineers in the fields of systems architecture, logic and circuit design, chips and wafer fabrication, packaging, testing, and systems applications. Generation of specifications, design, and verification must be performed at all abstraction levels, including the system, register-transfer, logic, circuit, transistor, and process levels.", "name": "Very Large Scale Integration (VLSI) Systems, IEEE Transactions on", "subjectList": ["Components, Circuits, Devices & Systems"], "influence": "0.611", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=92", "eigen": "0.01199"}, {"impact": "3.078", "info": "TVCG is a scholarly, archival journal published monthly. Its Editorial Board strives to publish papers that present important research results and state-of-the-art seminal papers in computer graphics, visualization, and virtual reality.  Specific topics include, but are not limited to: rendering technologies; geometric modeling and processing; shape analysis; graphics hardware; animation and simulation; perception, interaction and user interfaces; haptics; computational photography; high-dynamic range imaging and display; user studies and evaluation; biomedical visualization; volume visualization and graphics; visual analytics for machine learning; topology-based visualization; visual programming and software visualization; visualization in data science; virtual reality, augmented reality and mixed reality; advanced display technology, (e.g., 3D, immersive and multi-modal displays); applications of computer graphics and visualization.", "name": "Visualization and Computer Graphics, IEEE Transactions on", "subjectList": ["Bioengineering", "Computing & Processing"], "influence": "1.2", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=2945", "eigen": "0.01812"}, {"impact": "3.096", "info": "IEEE Wireless Communications Letters publishes short papers in a rapid publication cycle on advances in the state-of-the-art of wireless communications. Both theoretical contributions (including new techniques, concepts, and analyses) and practical contributions (including system experiments and prototypes, and new applications) are encouraged. This journal focuses on the physical layer and the link layer of wireless communication systems.", "name": "Wireless Communications Letters, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "0.882", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962382", "eigen": "0.01013"}, {"impact": "5.888", "info": "The IEEE Transactions on Wireless Communications publishes high-quality manuscripts on advances in the state-of-the-art of wireless communications. Both theoretical contributions (including new techniques, concepts, and analyses) and practical contributions (including system experiments and prototypes, and new applications) are encouraged.  The general scope of the Transactions includes, but is not limited to, the following: Modulation and coding , Detection and estimation, Diversity techniques and equalization, Propagation and channel characterization, Fading countermeasures, Multiuser detection, Signal separation and interference rejection, DSP applications to wireless systems, Broadband wireless communications, Network architectures and protocols, with an emphasis on physical and link layer communication, Adaptive antennas for wireless systems, Multiple access techniques, Space-time processing , Synchronization techniques, Software radio, Resource allocation and interference management, Multirate and multicarrier communications, Security, privacy, and authentication, Experimental and prototype results, Systems and services including mobile satellites, wireless local loops, wireless LANs, wireless PBX, and PCS/cellular.\r\nIn addition, papers on specific topics or on more non-traditional topics related to specific application areas, are encouraged.  Examples include Simulation tools and methodologies for design, analysis, rapid prototyping, performance prediction, and cellular system engineering; Orthogonal frequency division multiplexing; MIMO systems, and Wireless over optical.", "name": "Wireless Communications, IEEE Transactions on", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "1.643", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7693", "eigen": "0.06163"}, {"impact": "9.202", "info": "\r\n\tIEEE Wireless Communications is designed for individuals working in the communications and networking communities. It covers technical and policy issues relating to personalized, location-independent communications in all media (and combinations of media), and at all protocol layers. Both wired and wireless communications are covered as well as computing, the mobility of people, communicating devices, and personal services. Each issue of this interdisciplinary magazine provides articles of high quality and depth concerning the revolutionary technological advances in personal, location-independent communications and computing.", "name": "Wireless Communications Magazine, IEEE", "subjectList": ["Communication, Networking & Broadcasting", "Computing & Processing"], "influence": "2.966", "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7742", "eigen": "0.01766"}, {"impact": 0, "info": "IEEE Women in Engineering Magazine is the first magazine to focus on issues facing women who study or work in IEEE's fields of interest. The premiere issue, published in 2008, featured articles covering the political and international issues surrounding technology, including cultural differences in the workplace.", "name": "Women in Engineering Magazine, IEEE", "subjectList": ["Engineering Profession", "General Topics for Engineers"], "influence": 0, "href": "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4509581", "eigen": 0}]